<template>
  <div>
    <infoScan ref="infoScan" :code="code" />
    <lineScan
      ref="lineScan"
      :code="linecode"
    />
    <svg width="748px" height="845px" viewBox="0 0 748 845" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
      <!-- Generator: Sketch 54.1 (76490) - https://sketchapp.com -->
      <title>氢氮系统_b1系统</title>
      <desc>Created with Sketch.</desc>
      <defs>
        <path id="path-1" d="M243,84 L243,78 L250.358973,78 C252.568112,78 254.358973,79.790861 254.358973,82 L254.358973,150 L248.358973,150 L248.358973,86 C248.358973,84.8954305 247.463543,84 246.358973,84 L243,84 Z" />
        <filter id="filter-2" x="-22.0%" y="-3.5%" width="144.0%" height="106.9%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.812386775   0 0 0 0 0.256543192   0 0 0 0 0  0 0 0 0.806135271 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-3" d="M207,392 L207,352 L213,352 L213,395 C213,397.209139 211.209139,399 209,399 L203,399 L203,393 L206,393 C206.552285,393 207,392.552285 207,392 Z" />
        <filter id="filter-4" x="-25.0%" y="-5.3%" width="150.0%" height="110.6%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-5" d="M207.199285,571 L201.199285,571 L201.199285,532 C201.199285,529.790861 202.990146,528 205.199285,528 L211.199285,528 L211.199285,534 L208.199285,534 C207.647,534 207.199285,534.447715 207.199285,535 L207.199285,571 Z" />
        <filter id="filter-6" x="-25.0%" y="-5.8%" width="150.0%" height="111.6%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-7" d="M6,251 L-2.84217094e-14,251 L-2.88657986e-14,171 C-2.91363401e-14,168.790861 1.790861,167 4,167 L9.80995368,167 L9.80995368,173 L8,173 C6.8954305,173 6,173.895431 6,175 L6,251 Z" />
        <filter id="filter-8" x="-15.3%" y="-1.8%" width="130.6%" height="103.6%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="0.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.262900424   0 0 0 0 0.372847131   0 0 0 0 0.775985054  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <polygon id="path-9" points="31.5 114 25.5 114 25.5 0 31.5 0" />
        <filter id="filter-10" x="-25.0%" y="-1.3%" width="150.0%" height="102.6%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="0.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.262900424   0 0 0 0 0.372847131   0 0 0 0 0.775985054  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-11" d="M197.199285,819 L191.199285,819 L191.199285,739 C191.199285,736.790861 192.990146,735 195.199285,735 L201.009239,735 L201.009239,741 L197.199285,741 L197.199285,819 Z" />
        <filter id="filter-12" x="-25.5%" y="-3.0%" width="151.0%" height="106.0%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-13" d="M243,651 L249,651 L249,693 C249,695.209139 247.209139,697 245,697 L241,697 L241,691 L243,691 L243,651 Z" />
        <filter id="filter-14" x="-31.3%" y="-5.4%" width="162.5%" height="110.9%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-15" d="M29,358 L29,487 L23,487 L23,356 C23,353.790861 24.790861,352 27,352 L31.1900463,352 L31.1900463,358 L29,358 Z" />
        <filter id="filter-16" x="-18.3%" y="-1.1%" width="136.6%" height="102.2%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="0.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.262900424   0 0 0 0 0.372847131   0 0 0 0 0.775985054  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-17" d="M198,35 L203,35 L203,41 L194,41 C191.790861,41 190,39.209139 190,37 L190,0 L196,0 L196,33 C196,34.1045695 196.895431,35 198,35 Z" />
        <filter id="filter-18" x="-19.2%" y="-6.1%" width="138.5%" height="112.2%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.812386775   0 0 0 0 0.256543192   0 0 0 0 0  0 0 0 0.806135271 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-19" d="M54,238.541486 L54,298.541486 L48,298.541486 L48,234.541486 C48,232.332347 49.790861,230.541486 52,230.541486 L193,230.541486 L193,236.541486 L56,236.541486 C54.8954305,236.541486 54,237.436917 54,238.541486 Z" />
        <filter id="filter-20" x="-1.0%" y="-2.2%" width="102.1%" height="104.4%" filterUnits="objectBoundingBox">
          <feMorphology radius="2" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="0.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.262900424   0 0 0 0 0.372847131   0 0 0 0 0.775985054  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <polygon id="path-21" points="233.5 298.541486 227.5 298.541486 227.5 246 233.5 246" />
        <filter id="filter-22" x="-41.7%" y="-4.8%" width="183.3%" height="109.5%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-23" d="M204,465.687877 L204,428.5 L210,428.5 L210,463.687877 L229.5,463.687877 C231.709139,463.687877 233.5,465.478738 233.5,467.687877 L233.5,475.5 L227.5,475.5 L227.5,469.687877 L208,469.687877 C205.790861,469.687877 204,467.897016 204,465.687877 Z" />
        <filter id="filter-24" x="-8.5%" y="-5.3%" width="116.9%" height="110.6%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-25" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-26" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-27" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-28" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
      </defs>
      <g id="工艺图" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
        <g id="氢氮系统_b1系统" transform="translate(-911.000000, -175.000000)">
          <g transform="translate(910.983485, 172.000000)">
            <g id="分组-2" transform="translate(0.016515, 29.000000)">
              <g id="qd_nyzx_dlzf1_qdjq3_zq3" transform="translate(17.000000, 487.000000)" @click="showInfo">
                <g>
                  <path id="矩形" d="M0.5,18.5 L0.5,80.5 L69.5,80.5 L69.5,18.5 L0.5,18.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="矩形-copy-8" d="M0.5,18.5 L0.5,80.5 L22.5,80.5 L22.5,18.5 L0.5,18.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="矩形-copy-27" d="M0.5,13.5 L0.5,18.5 L69.5,18.5 L69.5,13.5 L0.5,13.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="矩形-copy-9" d="M0.616670495,0.5 L3.36314937,13.5 L66.6368506,13.5 L69.3833295,0.5 L0.616670495,0.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" transform="translate(35.000000, 7.000000) scale(1, -1) translate(-35.000000, -7.000000) " />
                  <path id="矩形-copy-26" d="M21.5524938,2.5 L22.4524938,11.5 L47.5475062,11.5 L48.4475062,2.5 L21.5524938,2.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" transform="translate(35.000000, 7.000000) scale(1, -1) translate(-35.000000, -7.000000) " />
                  <circle id="椭圆形" fill="#586CB4" cx="43" cy="7" r="2" />
                  <rect id="矩形" fill="#586CB4" x="26" y="5" width="12" height="4" />
                  <text font-family="MicrosoftYaHeiUISemibold, Microsoft YaHei UI" font-size="9" font-weight="500" letter-spacing="0.03461541" fill="#586CB4">
                    <tspan x="28.884897" y="32">B1制氢机</tspan>
                  </text>
                </g>
              </g>
              <g id="路径-66-copy" fill-rule="nonzero">
                <use fill="#FFD0BB" xlink:href="#path-1" />
                <use fill="black" fill-opacity="1" filter="url(#filter-2)" xlink:href="#path-1" />
              </g>
              <g id="路径-67-copy-2" fill-rule="nonzero" transform="translate(208.000000, 375.500000) scale(-1, -1) translate(-208.000000, -375.500000) ">
                <use fill="#98E6D7" xlink:href="#path-3" />
                <use fill="black" fill-opacity="1" filter="url(#filter-4)" xlink:href="#path-3" />
              </g>
              <path id="路径-68-copy" d="" stroke="#979797" />
              <g id="路径-70-copy-3" fill-rule="nonzero">
                <use fill="#98E6D7" xlink:href="#path-5" />
                <use fill="black" fill-opacity="1" filter="url(#filter-6)" xlink:href="#path-5" />
              </g>
              <g id="分组-2-copy" transform="translate(-0.000000, 568.000000)">
                <g id="路径-70-copy-2" fill-rule="nonzero">
                  <use fill="#ABBDFF" xlink:href="#path-7" />
                  <use fill="black" fill-opacity="1" filter="url(#filter-8)" xlink:href="#path-7" />
                </g>
                <g id="氨气储气罐" transform="translate(10.000000, 114.000000)">
                  <g>
                    <g id="分组-7" transform="translate(8.884072, 67.069207)">
                      <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                      <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                    </g>
                    <g id="分组-7-copy-3" transform="translate(26.000000, 70.000000) scale(-1, 1) translate(-26.000000, -70.000000) translate(22.000000, 67.000000)">
                      <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                      <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                    </g>
                    <path id="路径" d="M28.2573359,1.22401736 C30.4704376,1.7975393 31.8799629,3.82030128 31.8799629,6.22762063 L31.8799629,63.057651 C31.8799629,65.9109563 29.8084055,68.2240174 26.9745474,68.2240174 L11.8638738,68.2240174 C9.71047112,68.2240174 7.86689195,66.8884021 7.10570144,64.9950384 C12.5134108,66.2773055 17.7941036,61.8832176 22.94778,51.8127747 C28.1014564,41.7423318 29.8713083,24.8794127 28.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                    <g id="分组-10-copy" transform="translate(3.500000, 56.000000) scale(-1, 1) translate(-3.500000, -56.000000) translate(0.000000, 51.000000)">
                      <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                      <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                      <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                      <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                    </g>
                    <path id="合并形状" d="M16.4121094,39 L15.0234375,39 L10.4589844,31.9394531 C10.3300775,31.7402334 10.2265629,31.5429697 10.1484375,31.3476562 L10.1132812,31.3476562 C10.1445314,31.5507823 10.1601562,31.9746062 10.1601562,32.6191406 L10.1601562,39 L9,39 L9,29.9238281 L10.4707031,29.9238281 L14.9121094,36.8613281 C15.1230479,37.1894548 15.2480467,37.3984371 15.2871094,37.4882812 L15.3105469,37.4882812 C15.2714842,37.2304675 15.2519531,36.7890656 15.2519531,36.1640625 L15.2519531,29.9238281 L16.4121094,29.9238281 L16.4121094,39 Z M25.6933594,39 L24.5214844,39 L24.5214844,34.9101562 L19.9277344,34.9101562 L19.9277344,39 L18.7558594,39 L18.7558594,29.9238281 L19.9277344,29.9238281 L19.9277344,33.8671875 L24.5214844,33.8671875 L24.5214844,29.9238281 L25.6933594,29.9238281 L25.6933594,39 Z M26.456543,41.8618164 C26.9223656,42.2221698 27.4482393,42.4023438 28.0341797,42.4023438 C28.502932,42.4023438 28.8742662,42.2873547 29.1481934,42.057373 C29.4221205,41.8273914 29.559082,41.5190449 29.559082,41.1323242 C29.559082,40.2709918 28.942389,39.840332 27.7089844,39.840332 L27.1420898,39.840332 L27.1420898,39.128418 L27.6826172,39.128418 C28.7753961,39.128418 29.3217773,38.7241251 29.3217773,37.9155273 C29.3217773,37.1684533 28.904301,36.7949219 28.0693359,36.7949219 C27.5917945,36.7949219 27.142092,36.9560531 26.7202148,37.2783203 L26.7202148,36.465332 C27.1655296,36.2075182 27.6855439,36.0786133 28.2802734,36.0786133 C28.8603545,36.0786133 29.3261701,36.2302231 29.6777344,36.5334473 C30.0292986,36.8366714 30.2050781,37.2299781 30.2050781,37.7133789 C30.2050781,38.6040084 29.7509811,39.1767565 28.8427734,39.4316406 L28.8427734,39.4492188 C29.3349634,39.5019534 29.7238755,39.6755356 30.0095215,39.9699707 C30.2951674,40.2644058 30.4379883,40.6313455 30.4379883,41.0708008 C30.4379883,41.6831085 30.2175315,42.1767559 29.7766113,42.5517578 C29.3356912,42.9267597 28.7490271,43.1142578 28.0166016,43.1142578 C27.3720671,43.1142578 26.8520528,42.9941418 26.456543,42.7539062 L26.456543,41.8618164 Z" fill="#3D5278" fill-rule="nonzero" />
                    <path id="矩形" d="M10.0276239,1.50345579 C13.2622538,0.168545708 16.5021695,-0.5 19.7442957,-0.5 C22.9864195,-0.5 26.226333,0.168544686 29.4609582,1.50345159 C31.1453698,2.19858458 32.2442957,3.84092925 32.2442957,5.66314349 L32.2442957,64 C32.2442957,66.4852814 30.2295771,68.5 27.7442957,68.5 L11.7442957,68.5000001 C9.25901437,68.5000001 7.24429574,66.4852815 7.24429574,64 L7.24430536,5.66313821 C7.2443054,3.84093462 8.34322339,2.19859662 10.0276239,1.50345579 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  </g>
                </g>
                <g id="路径-76" fill-rule="nonzero">
                  <use fill="#ABBDFF" xlink:href="#path-9" />
                  <use fill="black" fill-opacity="1" filter="url(#filter-10)" xlink:href="#path-9" />
                </g>
              </g>
              <g id="路径-70-copy-4" fill-rule="nonzero">
                <use fill="#98E6D7" xlink:href="#path-11" />
                <use fill="black" fill-opacity="1" filter="url(#filter-12)" xlink:href="#path-11" />
              </g>
              <g id="路径-71-copy-2" fill-rule="nonzero">
                <use fill="#98E6D7" xlink:href="#path-13" />
                <use fill="black" fill-opacity="1" filter="url(#filter-14)" xlink:href="#path-13" />
              </g>
              <g id="路径-72-copy" fill-rule="nonzero">
                <use fill="#ABBDFF" xlink:href="#path-15" />
                <use fill="black" fill-opacity="1" filter="url(#filter-16)" xlink:href="#path-15" />
              </g>
              <g id="路径-74-copy" fill-rule="nonzero">
                <use fill="#FFD0BB" xlink:href="#path-17" />
                <use fill="black" fill-opacity="1" filter="url(#filter-18)" xlink:href="#path-17" />
              </g>
              <g id="箭头" transform="translate(190.000000, 7.000000)" fill="#B13701" fill-rule="nonzero">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
              <g id="箭头" transform="translate(249.000000, 98.000000)" fill="#B13701" fill-rule="nonzero">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
              <g id="路径-73-copy" fill-rule="nonzero">
                <use fill="#ABBDFF" xlink:href="#path-19" />
                <use fill="black" fill-opacity="1" filter="url(#filter-20)" xlink:href="#path-19" />
              </g>
              <g id="路径-67-copy-3" fill-rule="nonzero">
                <use fill="#98E6D7" xlink:href="#path-21" />
                <use fill="black" fill-opacity="1" filter="url(#filter-22)" xlink:href="#path-21" />
              </g>
              <g id="加氢纯化机组" transform="translate(193.000000, 150.000000)">
                <g transform="translate(0.000000, -0.000000)">
                  <g id="分组-7" transform="translate(29.000000, 95.000000)" fill="#FFFFFF" stroke="#586DB7">
                    <path id="矩形" d="M4.15254865,0.5 L1.15254865,0.5 L1.15254865,5.5 L4.15254865,5.5 L4.15254865,0.5 Z" />
                    <path id="矩形-copy-22" d="M12.5,0.5 L9.5,0.5 L9.5,5.5 L12.5,5.5 L12.5,0.5 Z" />
                    <path id="矩形-copy-23" d="M33.5,0.5 L30.5,0.5 L30.5,5.5 L33.5,5.5 L33.5,0.5 Z" />
                    <path id="矩形-copy-24" d="M41.5,0.5 L38.5,0.5 L38.5,5.5 L41.5,5.5 L41.5,0.5 Z" />
                  </g>
                  <path id="矩形" d="M30,17.5 C28.0670034,17.5 26.5,19.0670034 26.5,21 L26.5,92 C26.5,93.9329966 28.0670034,95.5 30,95.5 L42,95.5 C43.9329966,95.5 45.5,93.9329966 45.5,92 L45.5,21 C45.5,19.0670034 43.9329966,17.5 42,17.5 L30,17.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <rect id="矩形-copy-10" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="17.5" y="44.5" width="7" height="46" rx="3.5" />
                  <path id="路径" d="M32.5,17.5 L39.5,17.5 L39.5,12 C39.5,11.1715729 38.8284271,10.5 38,10.5 L37.5,10.5 L37.5,5 C37.5,4.17157288 38.1715729,3.5 39,3.5 L62,3.5 C62.8284271,3.5 63.5,4.17157288 63.5,5 L63.5,10.5 L63,10.5 C62.1715729,10.5 61.5,11.1715729 61.5,12 L61.5,17.5 L68.5,17.5 L68.5,12 C68.5,11.1715729 67.8284271,10.5 67,10.5 L66.5,10.5 L66.5,2 C66.5,1.17157288 65.8284271,0.5 65,0.5 L36,0.5 C35.1715729,0.5 34.5,1.17157288 34.5,2 L34.5,10.5 L34,10.5 C33.1715729,10.5 32.5,11.1715729 32.5,12 L32.5,17.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="矩形-copy-6" d="M59,17.5 C57.0670034,17.5 55.5,19.0670034 55.5,21 L55.5,92 C55.5,93.9329966 57.0670034,95.5 59,95.5 L71,95.5 C72.9329966,95.5 74.5,93.9329966 74.5,92 L74.5,21 C74.5,19.0670034 72.9329966,17.5 71,17.5 L59,17.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="矩形-copy-21" d="M72.2464548,17.432108 L72.2464548,17.432108 C73.6649359,17.5416085 74.7614089,18.7223054 74.7658251,20.1449999 L74.9873531,91.5107834 C74.9942105,93.719912 73.208917,95.5163236 70.9997884,95.5231809 C70.9739673,95.5232611 70.948146,95.5230912 70.9223281,95.5226713 C65.0023281,95.4263937 60.9462814,95.3325867 58.7541882,95.2412505 C57.1197089,95.2566752 66.9487908,101.254254 70.099226,76.1819561 C72.1995161,59.467091 72.9152591,39.8838083 72.2464548,17.432108 Z" fill="#5B72C3" opacity="0.195954244" />
                  <path id="矩形-copy-25" d="M42.674252,17.432108 L42.674252,17.432108 C44.0927331,17.5416085 45.1892062,18.7223054 45.1936224,20.1449999 L45.4151504,91.5107834 C45.4220078,93.719912 43.6367142,95.5163236 41.4275857,95.5231809 C41.4017645,95.5232611 41.3759432,95.5230912 41.3501254,95.5226713 C35.4301253,95.4263937 31.3740787,95.3325867 29.1819854,95.2412505 C27.5475061,95.2566752 37.376588,101.254254 40.5270232,76.1819561 C42.6273134,59.467091 43.3430563,39.8838083 42.674252,17.432108 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="8.5" y="31.5" width="4" height="22" />
                  <rect id="矩形" stroke="#586CB4" fill="#FFFFFF" x="-0.5" y="53.5" width="23" height="47" rx="1" />
                  <path id="合并形状" d="M6,59 L16,59 L16,65 L6,65 L6,59 Z M7,70.0010417 C6.44771525,70.0010417 6,69.5530932 6,69.0005208 C6,68.4479484 6.44771525,68 7,68 C7.55228475,68 8,68.4479484 8,69.0005208 C8,69.5530932 7.55228475,70.0010417 7,70.0010417 Z M11,70.0010417 C10.4477153,70.0010417 10,69.5530932 10,69.0005208 C10,68.4479484 10.4477153,68 11,68 C11.5522847,68 12,68.4479484 12,69.0005208 C12,69.5530932 11.5522847,70.0010417 11,70.0010417 Z M15,70.0010417 C14.4477153,70.0010417 14,69.5530932 14,69.0005208 C14,68.4479484 14.4477153,68 15,68 C15.5522847,68 16,68.4479484 16,69.0005208 C16,69.5530932 15.5522847,70.0010417 15,70.0010417 Z" fill="#586CB4" />
                  <g id="分组-2" transform="translate(4.000000, 34.000000)">
                    <circle id="椭圆形" stroke="#586CB4" fill="#FFFFFF" cx="6.5" cy="6.5" r="6" />
                    <rect id="矩形" fill="#586CB4" x="6" y="0" width="1" height="7" rx="0.5" />
                    <rect id="矩形-copy-16" fill="#586CB4" transform="translate(3.848076, 4.933013) rotate(-60.000000) translate(-3.848076, -4.933013) " x="3.34807621" y="1.9330127" width="1" height="6" rx="0.5" />
                    <rect id="矩形-copy-17" fill="#586CB4" transform="translate(8.848076, 4.933013) scale(-1, 1) rotate(-60.000000) translate(-8.848076, -4.933013) " x="8.34807621" y="1.9330127" width="1" height="6" rx="0.5" />
                    <rect id="矩形-copy-18" fill="#586CB4" transform="translate(8.474874, 8.474874) scale(-1, -1) rotate(-45.000000) translate(-8.474874, -8.474874) " x="7.97487373" y="5.47487373" width="1" height="6" rx="0.5" />
                    <rect id="矩形-copy-19" fill="#586CB4" transform="translate(4.474874, 8.474874) scale(1, -1) rotate(-45.000000) translate(-4.474874, -8.474874) " x="3.97487373" y="5.47487373" width="1" height="6" rx="0.5" />
                    <rect id="矩形" stroke="#586CB4" fill="#FFFFFF" x="5.5" y="5.5" width="2" height="2" />
                  </g>
                  <rect id="矩形-copy-14" stroke="#586CB4" fill="#FFFFFF" transform="translate(50.500000, 89.000000) rotate(-90.000000) translate(-50.500000, -89.000000) " x="49" y="84" width="3" height="10" />
                  <rect id="矩形" stroke="#586CB4" fill="#FFFFFF" x="43.5" y="42.5" width="7" height="21" rx="2" />
                  <rect id="矩形-copy-20" stroke="#586CB4" fill="#FFFFFF" x="43.5" y="42.5" width="7" height="21" rx="2" />
                  <rect id="矩形-copy-7" stroke="#586CB4" fill="#FFFFFF" x="50.5" y="42.5" width="7" height="21" rx="2" />
                </g>
              </g>
              <g id="路径-69-copy" fill-rule="nonzero">
                <use fill="#98E6D7" xlink:href="#path-23" />
                <use fill="black" fill-opacity="1" filter="url(#filter-24)" xlink:href="#path-23" />
              </g>
              <g id="氮气储气罐" transform="translate(211.000000, 476.000000)">
                <g>
                  <g id="分组-7" transform="translate(8.884072, 67.069207)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <g id="分组-7-copy-3" transform="translate(26.000000, 70.000000) scale(-1, 1) translate(-26.000000, -70.000000) translate(22.000000, 67.000000)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <path id="路径" d="M28.2573359,1.22401736 C30.4704376,1.7975393 31.8799629,3.82030128 31.8799629,6.22762063 L31.8799629,63.057651 C31.8799629,65.9109563 29.8084055,68.2240174 26.9745474,68.2240174 L11.8638738,68.2240174 C9.71047112,68.2240174 7.86689195,66.8884021 7.10570144,64.9950384 C12.5134108,66.2773055 17.7941036,61.8832176 22.94778,51.8127747 C28.1014564,41.7423318 29.8713083,24.8794127 28.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                  <path id="矩形" d="M10.0276239,1.50345579 C13.2622538,0.168545708 16.5021695,-0.5 19.7442957,-0.5 C22.9864195,-0.5 26.226333,0.168544686 29.4609582,1.50345159 C31.1453698,2.19858458 32.2442957,3.84092925 32.2442957,5.66314349 L32.2442957,64 C32.2442957,66.4852814 30.2295771,68.5 27.7442957,68.5 L11.7442957,68.5000001 C9.25901437,68.5000001 7.24429574,66.4852815 7.24429574,64 L7.24430536,5.66313821 C7.2443054,3.84093462 8.34322339,2.19859662 10.0276239,1.50345579 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <g id="分组-10-copy" transform="translate(3.500000, 56.000000) scale(-1, 1) translate(-3.500000, -56.000000) translate(0.000000, 51.000000)">
                    <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                    <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                  </g>
                  <path id="N" d="M24.3941556,40 L21.8550931,40 L15.16564,29.7070312 C14.9963683,29.4466133 14.8563958,29.1764337 14.7457181,28.8964844 L14.6871244,28.8964844 C14.739208,29.195965 14.7652494,29.8372347 14.7652494,30.8203125 L14.7652494,40 L12.5191556,40 L12.5191556,25.9960938 L15.2242337,25.9960938 L21.6890775,36.0449219 C21.9625164,36.4615906 22.1382959,36.7480461 22.2164212,36.9042969 L22.2554837,36.9042969 C22.1903793,36.5332013 22.1578275,35.9049523 22.1578275,35.0195312 L22.1578275,25.9960938 L24.3941556,25.9960938 L24.3941556,40 Z" fill="#586CB4" fill-rule="nonzero" />
                  <path id="2" d="M29.9935246,44 L24.7200871,44 L24.7200871,43.3496094 C24.7200871,43.083983 24.7571961,42.8349621 24.8314152,42.6025391 C24.9056344,42.370116 25.0052427,42.1513682 25.1302434,41.9462891 C25.255244,41.7412099 25.4017269,41.5478525 25.5696965,41.3662109 C25.7376661,41.1845694 25.9173518,41.0087899 26.108759,40.8388672 C26.3001662,40.6689445 26.4954767,40.5048836 26.6946965,40.3466797 C26.8939162,40.1884758 27.0892268,40.0292977 27.280634,39.8691406 C27.4603224,39.7167961 27.6243833,39.5673835 27.7728215,39.4208984 C27.9212597,39.2744133 28.0482116,39.1230477 28.1536809,38.9667969 C28.2591501,38.8105461 28.3411806,38.6455087 28.3997746,38.4716797 C28.4583687,38.2978507 28.4876652,38.109376 28.4876652,37.90625 C28.4876652,37.6835926 28.4534859,37.4892586 28.3851262,37.3232422 C28.3167665,37.1572257 28.2210643,37.0185552 28.0980168,36.9072266 C27.9749693,36.7958979 27.829463,36.7119143 27.6614934,36.6552734 C27.4935238,36.5986325 27.3099319,36.5703125 27.1107121,36.5703125 C26.7669604,36.5703125 26.4173545,36.6503898 26.061884,36.8105469 C25.7064135,36.9707039 25.36462,37.2109359 25.0364934,37.53125 L25.0364934,36.2246094 C25.2083692,36.0957025 25.3821956,35.9833989 25.5579777,35.8876953 C25.7337599,35.7919917 25.9153987,35.7119144 26.1028996,35.6474609 C26.2904006,35.5830075 26.4876642,35.5351564 26.6946965,35.5039062 C26.9017288,35.4726561 27.1224297,35.4570312 27.3568059,35.4570312 C27.735714,35.4570312 28.0794606,35.5068354 28.3880559,35.6064453 C28.6966512,35.7060552 28.9603204,35.8525381 29.1790715,36.0458984 C29.3978226,36.2392588 29.5667662,36.4804673 29.6859074,36.7695312 C29.8050487,37.0585952 29.8646184,37.3906231 29.8646184,37.765625 C29.8646184,38.1054704 29.8226266,38.4111315 29.7386418,38.6826172 C29.654657,38.9541029 29.5355176,39.2070301 29.3812199,39.4414062 C29.2269223,39.6757824 29.0404007,39.8984364 28.8216496,40.109375 C28.6028985,40.3203136 28.3587603,40.5371083 28.0892277,40.7597656 C27.8626641,40.9433603 27.6370804,41.1220694 27.4124699,41.2958984 C27.1878594,41.4697274 26.985713,41.6396476 26.8060246,41.8056641 C26.6263362,41.9716805 26.4808299,42.1376945 26.3695012,42.3037109 C26.2581725,42.4697274 26.202509,42.6367179 26.202509,42.8046875 L26.202509,42.8339844 L29.9935246,42.8339844 L29.9935246,44 Z" fill="#586CB4" fill-rule="nonzero" />
                </g>
              </g>
              <g id="氢氮系统储气罐-copy" transform="translate(203.000000, 26.000000)">
                <g id="分组-7" transform="translate(9.884072, 67.069207)">
                  <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <path id="矩形-copy-14" d="M5.06990104,11 C5.39669571,11.7985686 5.84107599,12.3384865 6.4030419,12.6197536 C6.9650078,12.9010207 7.52062752,12.7195674 8.06990104,12.0753938 L8.06990104,15 L5.06990104,15 L5.06990104,11 Z" fill="#5B72C3" opacity="0.195954244" transform="translate(6.569901, 13.000000) scale(-1, 1) translate(-6.569901, -13.000000) " />
                <rect id="矩形-copy-10" stroke="#586CB4" x="4.56990104" y="8.5" width="4" height="7" />
                <path id="矩形-copy-13" d="M0,10.4283185 C0.63291731,11.6876032 1.21613662,12.4506836 1.74965792,12.7175596 C2.28317922,12.9844357 3.0565936,13.2202281 4.06990104,13.424937 L4.06990104,16.3339803 C4.06990104,16.59603 3.86758059,16.8136228 3.60622322,16.8326593 L0.536322177,17.056261 C0.260909395,17.0763212 0.02138123,16.869317 0.00132104569,16.5939042 C0.000440639615,16.5818169 1.08907602e-13,16.5697015 1.08690834e-13,16.5575821 L0,10.4283185 Z" fill="#5B72C3" opacity="0.195954244" transform="translate(2.034951, 13.742961) scale(-1, 1) translate(-2.034951, -13.742961) " />
                <rect id="矩形-copy-11" stroke="#586CB4" x="-0.430098959" y="6.19809501" width="5" height="11" rx="0.5" />
                <g id="分组-7-copy-3" transform="translate(27.000000, 70.000000) scale(-1, 1) translate(-27.000000, -70.000000) translate(23.000000, 67.000000)">
                  <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <g id="分组-10-copy" transform="translate(33.000000, 51.000000)">
                  <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                  <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                </g>
                <path id="矩形" d="M11.0276239,1.50345579 C14.2622538,0.168545708 17.5021695,-0.5 20.7442957,-0.5 C23.9864195,-0.5 27.226333,0.168544686 30.4609582,1.50345159 C32.1453698,2.19858458 33.2442957,3.84092925 33.2442957,5.66314349 L33.2442957,64 C33.2442957,66.4852814 31.2295771,68.5 28.7442957,68.5 L12.7442957,68.5000001 C10.2590144,68.5000001 8.24429574,66.4852815 8.24429574,64 L8.24430536,5.66313821 C8.2443054,3.84093462 9.34322339,2.19859662 11.0276239,1.50345579 Z" stroke="#586CB4" fill="#FBFCFF" />
                <path id="路径" d="M29.2573359,1.22401736 C31.4704376,1.7975393 32.8799629,3.82030128 32.8799629,6.22762063 C32.8799629,42.4912027 32.8799629,61.5740956 32.8799629,63.4762991 C32.8799629,66.3296045 31.47969,68.2240174 28.6458318,68.2240174 C26.7565931,68.2240174 21.4959404,68.2240174 12.8638738,68.2240174 C10.7104711,68.2240174 8.86689195,66.8884021 8.10570144,64.9950384 C13.5134108,66.2773055 18.7941036,61.8832176 23.94778,51.8127747 C29.1014564,41.7423318 30.8713083,24.8794127 29.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                <g id="分组-10" transform="translate(0.000000, 6.698095)" />
                <path id="HN" d="M19.0140249,38 L17.3802358,38 L17.3802358,33.7480469 L12.765978,33.7480469 L12.765978,38 L11.1390249,38 L11.1390249,28.1972656 L12.765978,28.1972656 L12.765978,32.3193359 L17.3802358,32.3193359 L17.3802358,28.1972656 L19.0140249,28.1972656 L19.0140249,38 Z M29.800293,38 L28.0229492,38 L23.340332,30.7949219 C23.2218419,30.6126293 23.1238611,30.4235036 23.0463867,30.2275391 L23.0053711,30.2275391 C23.0418296,30.4371755 23.0600586,30.8860643 23.0600586,31.5742188 L23.0600586,38 L21.487793,38 L21.487793,28.1972656 L23.3813477,28.1972656 L27.9067383,35.2314453 C28.0981455,35.5231134 28.2211911,35.7236323 28.2758789,35.8330078 L28.3032227,35.8330078 C28.2576495,35.5732409 28.2348633,35.1334666 28.2348633,34.5136719 L28.2348633,28.1972656 L29.800293,28.1972656 L29.800293,38 Z" fill="#586CB4" fill-rule="nonzero" />
              </g>
              <g id="氢气储气罐" transform="translate(31.000000, 299.000000)">
                <g>
                  <g id="分组-7" transform="translate(8.884072, 67.069207)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <g id="分组-7-copy-3" transform="translate(26.000000, 70.000000) scale(-1, 1) translate(-26.000000, -70.000000) translate(22.000000, 67.000000)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <path id="路径" d="M28.2573359,1.22401736 C30.4704376,1.7975393 31.8799629,3.82030128 31.8799629,6.22762063 L31.8799629,63.057651 C31.8799629,65.9109563 29.8084055,68.2240174 26.9745474,68.2240174 L11.8638738,68.2240174 C9.71047112,68.2240174 7.86689195,66.8884021 7.10570144,64.9950384 C12.5134108,66.2773055 17.7941036,61.8832176 22.94778,51.8127747 C28.1014564,41.7423318 29.8713083,24.8794127 28.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                  <path id="矩形" d="M10.0276239,1.50345579 C13.2622538,0.168545708 16.5021695,-0.5 19.7442957,-0.5 C22.9864195,-0.5 26.226333,0.168544686 29.4609582,1.50345159 C31.1453698,2.19858458 32.2442957,3.84092925 32.2442957,5.66314349 L32.2442957,64 C32.2442957,66.4852814 30.2295771,68.5 27.7442957,68.5 L11.7442957,68.5000001 C9.25901437,68.5000001 7.24429574,66.4852815 7.24429574,64 L7.24430536,5.66313821 C7.2443054,3.84093462 8.34322339,2.19859662 10.0276239,1.50345579 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <g id="分组-10-copy" transform="translate(3.500000, 56.000000) scale(-1, 1) translate(-3.500000, -56.000000) translate(0.000000, 51.000000)">
                    <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                    <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                  </g>
                  <polygon id="H" fill="#586CB4" fill-rule="nonzero" points="24.0865384 40 21.7525541 40 21.7525541 33.9257812 15.1607572 33.9257812 15.1607572 40 12.8365384 40 12.8365384 25.9960938 15.1607572 25.9960938 15.1607572 31.8847656 21.7525541 31.8847656 21.7525541 25.9960938 24.0865384 25.9960938" />
                  <path id="2" d="M29.9935246,44 L24.7200871,44 L24.7200871,43.3496094 C24.7200871,43.083983 24.7571961,42.8349621 24.8314152,42.6025391 C24.9056344,42.370116 25.0052427,42.1513682 25.1302434,41.9462891 C25.255244,41.7412099 25.4017269,41.5478525 25.5696965,41.3662109 C25.7376661,41.1845694 25.9173518,41.0087899 26.108759,40.8388672 C26.3001662,40.6689445 26.4954767,40.5048836 26.6946965,40.3466797 C26.8939162,40.1884758 27.0892268,40.0292977 27.280634,39.8691406 C27.4603224,39.7167961 27.6243833,39.5673835 27.7728215,39.4208984 C27.9212597,39.2744133 28.0482116,39.1230477 28.1536809,38.9667969 C28.2591501,38.8105461 28.3411806,38.6455087 28.3997746,38.4716797 C28.4583687,38.2978507 28.4876652,38.109376 28.4876652,37.90625 C28.4876652,37.6835926 28.4534859,37.4892586 28.3851262,37.3232422 C28.3167665,37.1572257 28.2210643,37.0185552 28.0980168,36.9072266 C27.9749693,36.7958979 27.829463,36.7119143 27.6614934,36.6552734 C27.4935238,36.5986325 27.3099319,36.5703125 27.1107121,36.5703125 C26.7669604,36.5703125 26.4173545,36.6503898 26.061884,36.8105469 C25.7064135,36.9707039 25.36462,37.2109359 25.0364934,37.53125 L25.0364934,36.2246094 C25.2083692,36.0957025 25.3821956,35.9833989 25.5579777,35.8876953 C25.7337599,35.7919917 25.9153987,35.7119144 26.1028996,35.6474609 C26.2904006,35.5830075 26.4876642,35.5351564 26.6946965,35.5039062 C26.9017288,35.4726561 27.1224297,35.4570312 27.3568059,35.4570312 C27.735714,35.4570312 28.0794606,35.5068354 28.3880559,35.6064453 C28.6966512,35.7060552 28.9603204,35.8525381 29.1790715,36.0458984 C29.3978226,36.2392588 29.5667662,36.4804673 29.6859074,36.7695312 C29.8050487,37.0585952 29.8646184,37.3906231 29.8646184,37.765625 C29.8646184,38.1054704 29.8226266,38.4111315 29.7386418,38.6826172 C29.654657,38.9541029 29.5355176,39.2070301 29.3812199,39.4414062 C29.2269223,39.6757824 29.0404007,39.8984364 28.8216496,40.109375 C28.6028985,40.3203136 28.3587603,40.5371083 28.0892277,40.7597656 C27.8626641,40.9433603 27.6370804,41.1220694 27.4124699,41.2958984 C27.1878594,41.4697274 26.985713,41.6396476 26.8060246,41.8056641 C26.6263362,41.9716805 26.4808299,42.1376945 26.3695012,42.3037109 C26.2581725,42.4697274 26.202509,42.6367179 26.202509,42.8046875 L26.202509,42.8339844 L29.9935246,42.8339844 L29.9935246,44 Z" fill="#586CB4" fill-rule="nonzero" />
                </g>
              </g>
              <g id="氮气储气罐" transform="translate(213.000000, 299.000000)">
                <g>
                  <g id="分组-7" transform="translate(8.884072, 67.069207)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <g id="分组-7-copy-3" transform="translate(26.000000, 70.000000) scale(-1, 1) translate(-26.000000, -70.000000) translate(22.000000, 67.000000)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <path id="路径" d="M28.2573359,1.22401736 C30.4704376,1.7975393 31.8799629,3.82030128 31.8799629,6.22762063 L31.8799629,63.057651 C31.8799629,65.9109563 29.8084055,68.2240174 26.9745474,68.2240174 L11.8638738,68.2240174 C9.71047112,68.2240174 7.86689195,66.8884021 7.10570144,64.9950384 C12.5134108,66.2773055 17.7941036,61.8832176 22.94778,51.8127747 C28.1014564,41.7423318 29.8713083,24.8794127 28.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                  <path id="矩形" d="M10.0276239,1.50345579 C13.2622538,0.168545708 16.5021695,-0.5 19.7442957,-0.5 C22.9864195,-0.5 26.226333,0.168544686 29.4609582,1.50345159 C31.1453698,2.19858458 32.2442957,3.84092925 32.2442957,5.66314349 L32.2442957,64 C32.2442957,66.4852814 30.2295771,68.5 27.7442957,68.5 L11.7442957,68.5000001 C9.25901437,68.5000001 7.24429574,66.4852815 7.24429574,64 L7.24430536,5.66313821 C7.2443054,3.84093462 8.34322339,2.19859662 10.0276239,1.50345579 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <g id="分组-10-copy" transform="translate(3.500000, 56.000000) scale(-1, 1) translate(-3.500000, -56.000000) translate(0.000000, 51.000000)">
                    <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                    <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                  </g>
                  <path id="N" d="M24.3941556,40 L21.8550931,40 L15.16564,29.7070312 C14.9963683,29.4466133 14.8563958,29.1764337 14.7457181,28.8964844 L14.6871244,28.8964844 C14.739208,29.195965 14.7652494,29.8372347 14.7652494,30.8203125 L14.7652494,40 L12.5191556,40 L12.5191556,25.9960938 L15.2242337,25.9960938 L21.6890775,36.0449219 C21.9625164,36.4615906 22.1382959,36.7480461 22.2164212,36.9042969 L22.2554837,36.9042969 C22.1903793,36.5332013 22.1578275,35.9049523 22.1578275,35.0195312 L22.1578275,25.9960938 L24.3941556,25.9960938 L24.3941556,40 Z" fill="#586CB4" fill-rule="nonzero" />
                  <path id="2" d="M29.9935246,44 L24.7200871,44 L24.7200871,43.3496094 C24.7200871,43.083983 24.7571961,42.8349621 24.8314152,42.6025391 C24.9056344,42.370116 25.0052427,42.1513682 25.1302434,41.9462891 C25.255244,41.7412099 25.4017269,41.5478525 25.5696965,41.3662109 C25.7376661,41.1845694 25.9173518,41.0087899 26.108759,40.8388672 C26.3001662,40.6689445 26.4954767,40.5048836 26.6946965,40.3466797 C26.8939162,40.1884758 27.0892268,40.0292977 27.280634,39.8691406 C27.4603224,39.7167961 27.6243833,39.5673835 27.7728215,39.4208984 C27.9212597,39.2744133 28.0482116,39.1230477 28.1536809,38.9667969 C28.2591501,38.8105461 28.3411806,38.6455087 28.3997746,38.4716797 C28.4583687,38.2978507 28.4876652,38.109376 28.4876652,37.90625 C28.4876652,37.6835926 28.4534859,37.4892586 28.3851262,37.3232422 C28.3167665,37.1572257 28.2210643,37.0185552 28.0980168,36.9072266 C27.9749693,36.7958979 27.829463,36.7119143 27.6614934,36.6552734 C27.4935238,36.5986325 27.3099319,36.5703125 27.1107121,36.5703125 C26.7669604,36.5703125 26.4173545,36.6503898 26.061884,36.8105469 C25.7064135,36.9707039 25.36462,37.2109359 25.0364934,37.53125 L25.0364934,36.2246094 C25.2083692,36.0957025 25.3821956,35.9833989 25.5579777,35.8876953 C25.7337599,35.7919917 25.9153987,35.7119144 26.1028996,35.6474609 C26.2904006,35.5830075 26.4876642,35.5351564 26.6946965,35.5039062 C26.9017288,35.4726561 27.1224297,35.4570312 27.3568059,35.4570312 C27.735714,35.4570312 28.0794606,35.5068354 28.3880559,35.6064453 C28.6966512,35.7060552 28.9603204,35.8525381 29.1790715,36.0458984 C29.3978226,36.2392588 29.5667662,36.4804673 29.6859074,36.7695312 C29.8050487,37.0585952 29.8646184,37.3906231 29.8646184,37.765625 C29.8646184,38.1054704 29.8226266,38.4111315 29.7386418,38.6826172 C29.654657,38.9541029 29.5355176,39.2070301 29.3812199,39.4414062 C29.2269223,39.6757824 29.0404007,39.8984364 28.8216496,40.109375 C28.6028985,40.3203136 28.3587603,40.5371083 28.0892277,40.7597656 C27.8626641,40.9433603 27.6370804,41.1220694 27.4124699,41.2958984 C27.1878594,41.4697274 26.985713,41.6396476 26.8060246,41.8056641 C26.6263362,41.9716805 26.4808299,42.1376945 26.3695012,42.3037109 C26.2581725,42.4697274 26.202509,42.6367179 26.202509,42.8046875 L26.202509,42.8339844 L29.9935246,42.8339844 L29.9935246,44 Z" fill="#586CB4" fill-rule="nonzero" />
                </g>
              </g>
              <g id="减压阀" transform="translate(200.500000, 399.000000)">
                <g transform="translate(15.000000, 15.000000) rotate(-270.000000) translate(-15.000000, -15.000000) ">
                  <g transform="translate(0.000000, 0.000000)">
                    <path id="合并形状" d="M17.5706692,16 L18.1111111,16 L18.1111111,18.0200633 C19.9108341,18.4802979 21.2643072,19.9041023 21.9809581,21.5181586 L27,21.2727273 L27,25.9090909 L22.2652496,25.7186982 C21.3614732,28.1906097 18.4509153,30 15,30 C11.4098548,30 8.40454893,28.0416619 7.6352558,25.4163446 C8.87600064,26.8184109 10.0045973,27.8302644 12.5,27.8302644 C16.5,27.8302644 20.0555556,25.8544099 20.0555556,22.5909091 C20.0555556,20.6053569 19.0575309,19.2427443 17.3361301,18.4800454 L17.5032661,18.5 L17.5706692,16 Z" fill="#DFE3F4" />
                    <path id="合并形状" d="M12.5,17.3642549 L12.5,15.5 L18.5,15.5 L18.5,17.7379726 C20.2386733,18.5212145 21.5789994,19.8698079 22.191146,21.5 L27,21.5 L27,25.5 L22.191146,25.5 C21.2106012,28.111264 18.3616884,30 15,30 C11.6383116,30 8.78939885,28.111264 7.80885398,25.5 L3,25.5 L3,21.5 L7.80885398,21.5 C8.53383678,19.5693168 10.280189,18.0336137 12.5,17.3642549 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                    <rect id="矩形-copy-4" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="27" y="19.5" width="3" height="8" rx="0.5" />
                    <rect id="矩形-copy-16" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="0" y="19.5" width="3" height="8" rx="0.5" />
                    <rect id="矩形" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="14" y="6.5" width="2" height="3.5" />
                    <path id="合并形状" d="M18.5,12.5 L21.3,12.5 C21.6865993,12.5 22,12.8134007 22,13.2 L22,14.8 C22,15.1865993 21.6865993,15.5 21.3,15.5 L8.7,15.5 C8.31340068,15.5 8,15.1865993 8,14.8 L8,13.2 C8,12.8134007 8.31340068,12.5 8.7,12.5 L11.5,12.5 L11.5,11.7 C11.5,11.3134007 11.8134007,11 12.2,11 L17.8,11 C18.1865993,11 18.5,11.3134007 18.5,11.7 L18.5,12.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                    <rect id="矩形-copy-9" fill="#586CB4" x="12.5" y="0.5" width="5" height="7" rx="1" />
                    <rect id="矩形-copy-8" stroke="#586CB4" fill="#FFFFFF" transform="translate(15.000000, 11.000000) rotate(-90.000000) translate(-15.000000, -11.000000) " x="13.5" y="6" width="3" height="10" rx="0.2" />
                  </g>
                </g>
              </g>
              <g id="qd_nyzx_dlzf1_qdjq3_zd3" transform="translate(180.000000, 570.000000)" @click="showInfo">
                <g>
                  <path id="矩形-copy-28" d="M19.5,0.5 L19.5,80.5 L70.5,80.5 L70.5,0.5 L19.5,0.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <polygon id="矩形-copy-31" fill="#5B72C3" opacity="0.195954244" points="66.6838884 77.0535129 66.6838884 0 71 0 71 81 19 81 19 77.0535129" />
                  <text font-family="MicrosoftYaHeiUISemibold, Microsoft YaHei UI" font-size="9" font-weight="500" letter-spacing="0.03461541" fill="#586CB4">
                    <tspan x="27.884897" y="32">B1制氮机</tspan>
                  </text>
                  <rect id="矩形" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="3.5" y="17.5" width="3" height="6" rx="1" />
                  <rect id="矩形" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" x="10.5" y="71.5" width="9" height="8" />
                  <rect id="矩形-copy-41" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" transform="translate(10.000000, 13.500000) scale(1, -1) translate(-10.000000, -13.500000) " x="0.5" y="9.5" width="19" height="8" />
                  <path id="合并形状" d="M19.5,59.5 L19.5,56.5 L13.5,56.5 L13.5,71.5 L16.5,71.5 L16.5,59.5 L19.5,59.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <path id="合并形状-copy" d="M19.5,20.5 L19.5,17.5 L12.5,17.5 L12.5,32.5 L15.5,32.5 L15.5,20.5 L19.5,20.5 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" transform="translate(16.000000, 25.000000) scale(1, -1) translate(-16.000000, -25.000000) " />
                  <g id="分组-4" transform="translate(0.000000, 23.000000)">
                    <circle id="椭圆形-copy-4" stroke="#586CB4" fill="#FFFFFF" transform="translate(5.000000, 5.000000) scale(-1, -1) rotate(-360.000000) translate(-5.000000, -5.000000) " cx="5" cy="5" r="5" />
                    <polygon id="矩形" fill="#586CB4" transform="translate(5.000000, 5.000000) rotate(-45.000000) translate(-5.000000, -5.000000) " points="5.00490591 4 9 5 5.00791653 6 1 5" />
                  </g>
                </g>
              </g>
              <g id="储气罐小" transform="translate(201.000000, 682.000000)">
                <g id="储气罐" transform="translate(-0.000000, 0.000000)">
                  <g id="分组-7" transform="translate(8.884072, 67.069207)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <g id="分组-7-copy-3" transform="translate(26.000000, 70.000000) scale(-1, 1) translate(-26.000000, -70.000000) translate(22.000000, 67.000000)">
                    <path id="矩形" d="M6.59443701,1.5 L2.93462627,1.5 L1.44829504,5.43079334 L5.10810577,5.43079334 L6.59443701,1.5 Z" stroke="#586DB7" fill="#FFFFFF" />
                    <path id="矩形-copy-15" d="M3.5154017,0.930793345 L6.65647521,1.54714251 C6.55387978,2.15661535 6.41260989,2.46135177 6.23266554,2.46135177 C5.565315,2.46135177 5.04461307,2.68197921 4.38620178,3.19742448 C3.4052957,3.96533871 2.6485379,4.72088242 2.11592836,5.46405562 L3.5154017,0.930793345 Z" fill="#586CB4" opacity="0.201590402" />
                  </g>
                  <path id="路径" d="M28.2573359,1.22401736 C30.4704376,1.7975393 31.8799629,3.82030128 31.8799629,6.22762063 L31.8799629,63.057651 C31.8799629,65.9109563 29.8084055,68.2240174 26.9745474,68.2240174 L11.8638738,68.2240174 C9.71047112,68.2240174 7.86689195,66.8884021 7.10570144,64.9950384 C12.5134108,66.2773055 17.7941036,61.8832176 22.94778,51.8127747 C28.1014564,41.7423318 29.8713083,24.8794127 28.2573359,1.22401736 Z" fill="#5B72C3" opacity="0.195954244" />
                  <path id="矩形" d="M10.0276239,1.50345579 C13.2622538,0.168545708 16.5021695,-0.5 19.7442957,-0.5 C22.9864195,-0.5 26.226333,0.168544686 29.4609582,1.50345159 C31.1453698,2.19858458 32.2442957,3.84092925 32.2442957,5.66314349 L32.2442957,64 C32.2442957,66.4852814 30.2295771,68.5 27.7442957,68.5 L11.7442957,68.5000001 C9.25901437,68.5000001 7.24429574,66.4852815 7.24429574,64 L7.24430536,5.66313821 C7.2443054,3.84093462 8.34322339,2.19859662 10.0276239,1.50345579 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                  <g id="分组-10" transform="translate(33.000000, 6.698095)">
                    <path id="矩形-copy-14" d="M4.36983782e-13,4.30190499 C0.241637288,5.10047362 0.570219294,5.64039148 0.985746018,5.92165858 C1.40127274,6.20292568 1.81210699,6.0214724 2.21824876,5.37729874 L2.21824876,8.30190499 L4.36983782e-13,8.30190499 L4.36983782e-13,4.30190499 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-10" stroke="#586CB4" x="-0.5" y="1.80190499" width="3" height="7" />
                    <path id="矩形-copy-13" d="M2.93009896,3.7302235 C3.56301627,4.98950821 4.14623558,5.75258858 4.67975688,6.01946461 C5.21327818,6.28634065 5.98669255,6.5221331 7,6.72684197 L7,9.63588531 C7,9.89793504 6.79767955,10.1155278 6.53632218,10.1345643 L3.46642114,10.358166 C3.19100835,10.3782262 2.95148019,10.171222 2.93142,9.89580924 C2.9305396,9.88372186 2.93009896,9.87160646 2.93009896,9.85948706 L2.93009896,3.7302235 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-11" stroke="#586CB4" x="2.5" y="-0.5" width="5" height="11" rx="0.5" />
                  </g>
                  <g id="分组-10-copy" transform="translate(3.500000, 56.000000) scale(-1, 1) translate(-3.500000, -56.000000) translate(0.000000, 51.000000)">
                    <path id="矩形-copy-14" d="M0,4 C0.326794667,4.79856863 0.771174952,5.33848649 1.33314086,5.61975359 C1.89510676,5.90102069 2.45072647,5.71956741 3,5.07539375 L3,8 L0,8 L0,4 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2" width="3" height="6" />
                    <path id="矩形-copy-13" d="M2.93009896,3 C3.56301627,4.25928471 4.14623558,5.02236508 4.67975688,5.28924112 C5.21327818,5.55611715 5.98669255,5.7919096 7,5.99661848 L7,8.90566181 C7,9.16771155 6.79767955,9.38530434 6.53632218,9.40434077 L3.46642114,9.62794252 C3.19100835,9.64800271 2.95148019,9.44099853 2.93142,9.16558574 C2.9305396,9.15349836 2.93009896,9.14138297 2.93009896,9.12926357 L2.93009896,3 Z" fill="#5B72C3" opacity="0.195954244" />
                    <rect id="矩形-copy-11" stroke="#586CB4" x="3" y="0" width="4" height="10" rx="0.5" />
                  </g>
                </g>
              </g>
            </g>
            <text id="联网管" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
              <tspan x="172.435746" y="15">联网管</tspan>
            </text>
            <g id="箭头蓝色" transform="translate(51.000000, 303.110805) rotate(-270.000000) translate(-51.000000, -303.110805) translate(46.000000, 300.110805)" fill="#092692" fill-rule="nonzero">
              <path d="M6,2 L10,0 L10,6 L6,4 L6,6 L0,3 L6,0 L6,2 Z" />
            </g>
            <g id="箭头蓝色" transform="translate(26.000000, 453.000000) rotate(-270.000000) translate(-26.000000, -453.000000) translate(21.000000, 450.000000)" fill="#092692" fill-rule="nonzero">
              <path d="M6,2 L10,0 L10,6 L6,4 L6,6 L0,3 L6,0 L6,2 Z" />
            </g>
            <g id="箭头蓝色" transform="translate(28.000000, 671.000000) rotate(-270.000000) translate(-28.000000, -671.000000) translate(23.000000, 668.000000)" fill="#092692" fill-rule="nonzero">
              <path d="M6,2 L10,0 L10,6 L6,4 L6,6 L0,3 L6,0 L6,2 Z" />
            </g>
            <g id="箭头蓝色" transform="translate(3.000000, 795.000000) rotate(-270.000000) translate(-3.000000, -795.000000) translate(-2.000000, 792.000000)" fill="#092692" fill-rule="nonzero">
              <path d="M6,2 L10,0 L10,6 L6,4 L6,6 L0,3 L6,0 L6,2 Z" />
            </g>
            <g id="b1制氢机数据" transform="translate(41.016515, 605.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="64.48"
                y="30.48"
                width="71.04"
                height="22.08"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="64.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">运行状态</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zq3_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="69" y="47">{{ datas.qd_nyzx_dlzf1_qdjq3_zq3_yxsj }}h</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zq3_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="700" letter-spacing="0.0538462" fill="#28AA91">
                <tspan x="69" y="17">{{ getGuZhang(datas.qd_nyzx_dlzf1_qdjq3_zq3_yxzt) }}</tspan>
              </text>
            </g>
            <g id="b1zdgz" :class="datas.qd_nyzx_dlzf1_qdjq3_zd3_gz?'gzclass':'noclass'" transform="translate(203.016515, 612.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-26)" xlink:href="#path-25" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-25" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g id="b1zqgz" :class="datas.qd_nyzx_dlzf1_qdjq3_zd3_gz?'gzclass':'noclass'" transform="translate(29.016515, 545.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-28)" xlink:href="#path-27" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-27" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g id="b1制氮机数据" transform="translate(262.016515, 605.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="76">运行状态</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="107">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_yxsj }}h</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="700" letter-spacing="0.0538462" fill="#28AA91">
                <tspan x="68" y="77">{{ getGuZhang(datas.qd_nyzx_dlzf1_qdjq3_zd3_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="208.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="温度T1" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="145" y="16">温度T1</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_sbwd1" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="213" y="18">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_sbwd1 }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="208.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="208.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="温度T4" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="145" y="106">温度T4</tspan>
              </text>
              <text id="温度T3" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="145" y="76">温度T3</tspan>
              </text>
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">气体流量</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_sbwd4" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="213" y="107">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_sbwd4 }}℃</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_sbwd3" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="213" y="77">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_sbwd3 }}℃</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq2_zd2_ll" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="47">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_ll }}m³/h</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="208.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="温度T2" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="145" y="46">温度T2</tspan>
              </text>
              <text id="氮气浓度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">氮气浓度</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_sbwd2" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="213" y="48">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_sbwd2 }}℃</tspan>
              </text>
              <text id="qd_nyzx_dlzf1_qdjq3_zd3_nd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="18">{{ datas.qd_nyzx_dlzf1_qdjq3_zd3_nd }}%</tspan>
              </text>
            </g>
          </g>
        </g>
      </g>
    </svg>
  </div>
</template>
<script>
import infoScan from '@/views/project/monitor/infoScan'
import lineScan from '@/views/project/monitor/lineScan'
import monitorapi from '@/api/monitor/monitor'
import $ from 'jquery'
import '@/api/monitor/svgtool'
export default {
  name: 'System',
  components: {
    infoScan,
    lineScan
  },
  data() {
    return {
      datas: {
      },
      code: '',
      linecode: ''
    }
  },
  mounted() {
    $('svg').svgPanZoom()
    const self = this
    monitorapi.getQingDanData().then(res => {
      if (res.state === 1) {
        self.datas = res.data
      }
    }).catch(err => {
      console.log(err)
    })
    $('svg').click(function(e) {
      var linecode = (e.target.parentElement.attributes.id && e.target.parentElement.attributes.id.value) || (e.target.attributes.id && e.target.attributes.id.value)
      self.linecode = linecode
      if (linecode &&
          linecode.split('_').length === 6 &&
          linecode.indexOf('qd_nyzx_dlzf1_') !== -1 &&
          linecode.indexOf('_yxzt') === -1 &&
          linecode.indexOf('_kyjzt') === -1 &&
          linecode.indexOf('_yxsj') === -1) {
        self.$refs.lineScan.dialogTableVisible = true
      }
    })
  },
  methods: {
    showInfo(e) {
      this.code = e.currentTarget.attributes.id.value
      this.$refs.infoScan.dialogTableVisible = true
    },
    showLine(e) {
      this.linecode = e.currentTarget.attributes.code.value
      this.$refs.lineScan.dialogTableVisible = true
    },
    getGuZhang(type) {
      return monitorapi.getGuZhang(type)
    },
    getGuZhangGif(type) {
      return monitorapi.getGuZhangGif(type)
    },
    getGuZhangColor(type) {
      return monitorapi.getGuZhangColor(type)
    },
    getOrigin(id) {
      if (!id) return
      const box = document.getElementById(id + '_1').getBBox()
      const x = box.x + (box.width / 2)
      const y = box.y + (box.height / 2)
      const a = x + 'px' + ' ' + y + 'px'
      return '-webkit-transform-origin:' + a
    },
    getClass() {
      return 'zhuanquan'
    }
  }
}
</script>
<style scoped lang="scss">
@keyframes svg-load {
  from { transform:rotate(0)}
  to { transform:rotate(360deg)}
}

  @keyframes svg-load-ops {
  from { transform:rotate(360deg)}
  to { transform:rotate(0)}
}
.zhuanquan{
  animation:   svg-load 1s linear infinite;
  -webkit-animation:   svg-load 1s linear infinite;
  -moz-animation:   svg-load 1s linear infinite;
  -o-animation:   svg-load 1s linear infinite;
}
</style>

