<template>
  <div>
    <infoScan ref="infoScan" :code="code" />
    <lineScan
      ref="lineScan"
      :code="linecode"
    />
    <svg viewBox="0 0 1622 693" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
      <!-- Generator: Sketch 54.1 (76490) - https://sketchapp.com -->
      <title>1-3真空系统</title>
      <desc>Created with Sketch.</desc>
      <defs>
        <path id="path-1" d="M1192,121 L1192,194.011188 C1192,195.115758 1192.89543,196.011188 1194,196.011188 L1217,196.011188 L1217,202.011188 L1190,202.011188 C1187.79086,202.011188 1186,200.220327 1186,198.011188 L1186,121 L753,121 L753,194.011188 C753,195.115758 753.895431,196.011188 755,196.011188 L778,196.011188 L778,202.011188 L751,202.011188 C748.790861,202.011188 747,200.220327 747,198.011188 L747,121 L314,121 L314,194.011188 C314,195.115758 314.895431,196.011188 316,196.011188 L339,196.011188 L339,202.011188 L312,202.011188 C309.790861,202.011188 308,200.220327 308,198.011188 L308,121 L217,121 L217,115 L1387,115 C1388.10457,115 1389,114.104569 1389,113 L1389,19 C1389,17.8954305 1388.10457,17 1387,17 L217,17 L217,11 L1391,11 C1393.20914,11 1395,12.790861 1395,15 L1395,117 C1395,119.209139 1393.20914,121 1391,121 L1192,121 Z" />
        <filter id="filter-2" x="-0.2%" y="-1.3%" width="100.4%" height="102.6%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-3" d="M6,349.676427 L0,349.676427 L0,67 C-2.705415e-16,64.790861 1.790861,63 4,63 L168,63 L168,69 L8,69 C6.8954305,69 6,69.8954305 6,71 L6,349.676427 Z" />
        <filter id="filter-4" x="-1.5%" y="-0.9%" width="103.0%" height="101.7%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-5" d="M96,349.676427 L90,349.676427 L90,173 C90,170.790861 91.790861,169 94,169 L168.075053,169 L168.075053,175 L98,175 C96.8954305,175 96,175.895431 96,177 L96,349.676427 Z" />
        <filter id="filter-6" x="-3.2%" y="-1.4%" width="106.4%" height="102.8%" filterUnits="objectBoundingBox">
          <feGaussianBlur stdDeviation="2.5" in="SourceAlpha" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.078769375   0 0 0 0 0.464787138   0 0 0 0 0.390552953  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-7" d="M564,312.763227 L564,455.456075 C564,456.560644 564.895431,457.456075 566,457.456075 L608,457.456075 L608,463.456075 L562,463.456075 C559.790861,463.456075 558,461.665214 558,459.456075 L558,312.763227 L222,312.763227 C220.895431,312.763227 220,313.658658 220,314.763227 L220,455.456075 C220,456.560644 220.895431,457.456075 222,457.456075 L260,457.456075 L260,463.456075 L218,463.456075 C215.790861,463.456075 214,461.665214 214,459.456075 L214,310.763227 C214,308.554088 215.790861,306.763227 218,306.763227 L352.536271,306.763227 L352.536271,269 L358.536271,269 L358.536271,306.763227 L794.5,306.763227 L794.5,269 L800.5,269 L800.5,306.763227 L1228,306.763227 C1229.10457,306.763227 1230,305.867797 1230,304.763227 L1230,269 L1236,269 L1236,308.763227 C1236,310.972366 1234.20914,312.763227 1232,312.763227 L564,312.763227 Z" />
        <filter id="filter-8" x="-0.1%" y="-0.5%" width="100.2%" height="101.0%" filterUnits="objectBoundingBox">
          <feMorphology radius="1" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="0.5" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.951200181   0 0 0 0 0.271947552   0 0 0 0 0.271947552  0 0 0 0.936052229 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-9" d="M1175,352.676427 L1175,381.228037 C1175,382.332607 1175.89543,383.228037 1177,383.228037 L1320.89848,383.228037 C1323.10761,383.228037 1324.89848,385.018898 1324.89848,387.228037 L1324.89848,443 L1318.89848,443 L1318.89848,389.228037 L1173,389.228037 C1170.79086,389.228037 1169,387.437176 1169,385.228037 L1169,352.676427 L829,352.676427 L829,381.228037 C829,382.332607 829.895431,383.228037 831,383.228037 L974.898475,383.228037 C977.107614,383.228037 978.898475,385.018898 978.898475,387.228037 L978.898475,443 L972.898475,443 L972.898475,391.228037 C972.898475,390.123468 972.003045,389.228037 970.898475,389.228037 L827,389.228037 C824.790861,389.228037 823,387.437176 823,385.228037 L823,352.676427 L421.041691,352.676427 C418.832552,352.676427 417.041691,350.885566 417.041691,348.676427 L417.041691,269 L423.041691,269 L423.041691,344.676427 C423.041691,345.780996 423.937122,346.676427 425.041691,346.676427 L853.020846,346.676427 L853.020846,269 L859.020846,269 L859.020846,346.676427 L1287,346.676427 C1288.10457,346.676427 1289,345.780996 1289,344.676427 L1289,269 L1295,269 L1295,348.676427 C1295,350.885566 1293.20914,352.676427 1291,352.676427 L1175,352.676427 Z" />
        <filter id="filter-10" x="-0.2%" y="-0.9%" width="100.3%" height="101.7%" filterUnits="objectBoundingBox">
          <feMorphology radius="1" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="1" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.919865263   0 0 0 0 0.403295385   0 0 0 0 0  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-11" d="M675.81456,625.783183 L675.81456,524 L681.81456,524 L681.81456,625.783183 L883,625.783183 L883,631.783183 L324.5,631.783183 C322.290861,631.783183 320.5,629.992322 320.5,627.783183 L320.5,524 L326.5,524 L326.5,623.783183 C326.5,624.887753 327.395431,625.783183 328.5,625.783183 L675.81456,625.783183 Z" />
        <filter id="filter-12" x="-0.3%" y="-1.4%" width="100.5%" height="102.8%" filterUnits="objectBoundingBox">
          <feMorphology radius="1" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="1" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0   0 0 0 0 0.444495933   0 0 0 0 0.812386775  0 0 0 0.806135271 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <path id="path-13" d="M908,686 L1275,686 C1276.10457,686 1277,685.104569 1277,684 L1277,464.456075 C1277,462.246936 1278.79086,460.456075 1281,460.456075 L1292,460.456075 L1292,466.456075 L1285,466.456075 C1283.89543,466.456075 1283,467.351505 1283,468.456075 L1283,688 C1283,690.209139 1281.20914,692 1279,692 L224.197099,692 C221.98796,692 220.197099,690.209139 220.197099,688 L220.197099,512.566366 C220.197099,510.357227 221.98796,508.566366 224.197099,508.566366 L266,508.566366 L266,514.566366 L228.197099,514.566366 C227.09253,514.566366 226.197099,515.461797 226.197099,516.566366 L226.197099,684 C226.197099,685.104569 227.09253,686 228.197099,686 L561,686 L561,512.566366 C561,510.357227 562.790861,508.566366 565,508.566366 L610.802901,508.566366 L610.802901,514.566366 L569,514.566366 C567.895431,514.566366 567,515.461797 567,516.566366 L567,686 L902,686 L902,464 C902,461.790861 903.790861,460 906,460 L944.802901,460 L944.802901,466 L910,466 C908.895431,466 908,466.895431 908,468 L908,686 Z" />
        <filter id="filter-14" x="-0.1%" y="-0.6%" width="100.3%" height="101.3%" filterUnits="objectBoundingBox">
          <feMorphology radius="1" operator="erode" in="SourceAlpha" result="shadowSpreadInner1" />
          <feGaussianBlur stdDeviation="1" in="shadowSpreadInner1" result="shadowBlurInner1" />
          <feOffset dx="0" dy="0" in="shadowBlurInner1" result="shadowOffsetInner1" />
          <feComposite in="shadowOffsetInner1" in2="SourceAlpha" operator="arithmetic" k2="-1" k3="1" result="shadowInnerInner1" />
          <feColorMatrix values="0 0 0 0 0.919865263   0 0 0 0 0.403295385   0 0 0 0 0  0 0 0 1 0" type="matrix" in="shadowInnerInner1" />
        </filter>
        <linearGradient id="linearGradient-15" x1="94.9003547%" y1="50.9159131%" x2="6.65873833%" y2="48.601237%">
          <stop stop-color="#586CB4" stop-opacity="0.1" offset="0%" />
          <stop stop-color="#586CB4" stop-opacity="0.3" offset="100%" />
        </linearGradient>
        <path id="path-16" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-17" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-18" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-19" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-20" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-21" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-22" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-23" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-24" d="M25.4940603,3.82845847 L40.8607159,29.1811095 C42.2348089,31.4481545 41.5109282,34.3998802 39.2438832,35.7739732 C38.493653,36.2287 37.6331486,36.469125 36.7558677,36.469125 L6.02255659,36.469125 C3.37158979,36.469125 1.22255659,34.3200918 1.22255659,31.669125 C1.22255659,30.791844 1.4629816,29.9313397 1.91770838,29.1811095 L17.2843639,3.82845847 C18.6584569,1.5614134 21.6101826,0.837532731 23.8772276,2.21162575 C24.5385443,2.61246058 25.0932255,3.16714179 25.4940603,3.82845847 Z" />
        <filter id="filter-25" x="-10.0%" y="-5.4%" width="120.0%" height="126.0%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1.5" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-26" d="M15.9889894,2.34896799 L25.6346427,18.103535 C26.4997756,19.5165853 26.0556007,21.3634177 24.6425504,22.2285505 C24.1710472,22.5172259 23.6289439,22.6699966 23.0760888,22.6699966 L3.78478224,22.6699966 C2.12792799,22.6699966 0.784782239,21.3268508 0.784782239,19.6699966 C0.784782239,19.1171415 0.937552911,18.5750382 1.22622833,18.103535 L10.8718816,2.34896799 C11.7370145,0.935917681 13.5838468,0.491742814 14.9968971,1.35687566 C15.4013627,1.60450765 15.7413574,1.9445024 15.9889894,2.34896799 Z" />
        <filter id="filter-27" x="-10.1%" y="-7.0%" width="120.2%" height="126.8%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="1" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
        <path id="path-28" d="M15.9889894,2.34896799 L25.6346427,18.103535 C26.4997756,19.5165853 26.0556007,21.3634177 24.6425504,22.2285505 C24.1710472,22.5172259 23.6289439,22.6699966 23.0760888,22.6699966 L3.78478224,22.6699966 C2.12792799,22.6699966 0.784782239,21.3268508 0.784782239,19.6699966 C0.784782239,19.1171415 0.937552911,18.5750382 1.22622833,18.103535 L10.8718816,2.34896799 C11.7370145,0.935917681 13.5838468,0.491742814 14.9968971,1.35687566 C15.4013627,1.60450765 15.7413574,1.9445024 15.9889894,2.34896799 Z" />
        <filter id="filter-29" x="-10.1%" y="-7.0%" width="120.2%" height="126.8%" filterUnits="objectBoundingBox">
          <feOffset dx="0" dy="1" in="SourceAlpha" result="shadowOffsetOuter1" />
          <feGaussianBlur stdDeviation="1" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
          <feColorMatrix values="0 0 0 0 0.380392157   0 0 0 0 0.407843137   0 0 0 0 0.674509804  0 0 0 0.274776005 0" type="matrix" in="shadowBlurOuter1" />
        </filter>
      </defs>
      <g id="工艺图" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
        <g id="1-3真空系统" transform="translate(-298.000000, -241.000000)">
          <g transform="translate(298.000000, 242.000000)">
            <g id="真空储气罐" transform="translate(168.000000, 0.000000)">
              <g>
                <g id="分组-7" transform="translate(10.882988, 81.570657)">
                  <path id="矩形" d="M8.23914842,1.71621622 L3.51630131,1.71621622 L1.61319833,6.71312704 L6.33604544,6.71312704 L8.23914842,1.71621622 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M4.30636708,1.13204596 L8.15418213,1.88165981 C8.02850273,2.62291056 7.85544711,2.99353594 7.63501529,2.99353594 C6.81751088,2.99353594 6.17965101,3.26186661 5.37309718,3.8887595 C4.17148724,4.82270924 3.24445892,5.74161376 2.59201224,6.64547305 L4.30636708,1.13204596 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <g id="分组-7-copy-3" transform="translate(31.850000, 85.135135) scale(-1, 1) translate(-31.850000, -85.135135) translate(26.950000, 81.486486)">
                  <path id="矩形" d="M8.23914842,1.71621622 L3.51630131,1.71621622 L1.61319833,6.71312704 L6.33604544,6.71312704 L8.23914842,1.71621622 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M4.30636708,1.13204596 L8.15418213,1.88165981 C8.02850273,2.62291056 7.85544711,2.99353594 7.63501529,2.99353594 C6.81751088,2.99353594 6.17965101,3.26186661 5.37309718,3.8887595 C4.17148724,4.82270924 3.24445892,5.74161376 2.59201224,6.64547305 L4.30636708,1.13204596 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <path id="路径" d="M34.6152365,1.48866976 C37.326286,2.18619645 39.0529545,4.64631237 39.0529545,7.5741332 L39.0529545,76.6917377 C39.0529545,80.1619739 36.5152968,82.9751563 33.0438206,82.9751563 L14.5332454,82.9751563 C11.8953271,82.9751563 9.63694264,81.3507593 8.70448427,79.0480196 C15.3289282,80.6075337 21.7977769,75.2633728 28.1110305,63.0155368 C34.4242841,50.7677009 36.5923527,30.2587452 34.6152365,1.48866976 Z" fill="#5B72C3" opacity="0.195954244" />
                <path id="矩形" d="M11.7045151,2.19014181 C15.8604771,0.397565105 20.0223592,-0.5 24.1867631,-0.5 C28.3511688,-0.5 32.5130527,0.397565866 36.6690176,2.19014456 C38.318448,2.90159266 39.3867623,4.52584102 39.3867623,6.32216342 L39.3867623,78.7027027 C39.3867623,81.1879841 37.3720437,83.2027027 34.8867623,83.2027027 L13.4867623,83.2027028 C11.0014809,83.2027028 8.98676229,81.1879842 8.98676229,78.7027028 L8.9867661,6.32215929 C8.98676614,4.52583491 10.0550823,2.90158594 11.7045151,2.19014181 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                <g id="分组-10" transform="translate(40.425000, 8.146332)">
                  <path id="矩形-copy-14" d="M4.36983782e-13,5.23204661 C0.296005678,6.20327872 0.698518635,6.85993559 1.20753887,7.20201719 C1.71655911,7.5440988 2.21983106,7.32341238 2.71735473,6.53995793 L2.71735473,10.0969115 L4.36983782e-13,10.0969115 L4.36983782e-13,5.23204661 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-10" stroke="#586CB4" x="-0.5" y="2.29961418" width="3.45" height="8.2972973" />
                  <path id="矩形-copy-13" d="M3.58937122,4.53675831 C4.36469493,6.06832079 5.07913858,6.99639151 5.73270218,7.32097047 C6.38626577,7.64554943 7.33369838,7.93232404 8.575,8.18129429 L8.575,11.819598 C8.575,12.0817477 8.37253003,12.2993879 8.11106309,12.3182957 L4.12543432,12.6065146 C3.85001115,12.6264317 3.61059056,12.4193031 3.59067347,12.1438799 C3.58980559,12.1318785 3.58937122,12.1198496 3.58937122,12.1078168 L3.58937122,4.53675831 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-11" stroke="#586CB4" x="3.175" y="-0.5" width="5.9" height="13.1621622" rx="0.5" />
                </g>
                <g id="分组-10-copy" transform="translate(4.287500, 68.108108) scale(-1, 1) translate(-4.287500, -68.108108) translate(0.000000, 62.027027)">
                  <path id="矩形-copy-14" d="M0,4.86486486 C0.400323466,5.83609698 0.944689316,6.49275384 1.63309755,6.83483545 C2.32150578,7.17691705 3.00213993,6.95623063 3.675,6.17277618 L3.675,9.72972973 L0,9.72972973 L0,4.86486486 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2.43243243" width="3.675" height="7.2972973" />
                  <path id="矩形-copy-13" d="M3.58937122,3.64864865 C4.36469493,5.18021113 5.07913858,6.10828186 5.73270218,6.43286082 C6.38626577,6.75743978 7.33369838,7.04421438 8.575,7.29318463 L8.575,10.9314883 C8.575,11.193638 8.37253003,11.4112782 8.11106309,11.4301861 L4.12543432,11.7184049 C3.85001115,11.738322 3.61059056,11.5311934 3.59067347,11.2557703 C3.58980559,11.2437688 3.58937122,11.23174 3.58937122,11.2197072 L3.58937122,3.64864865 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-11" stroke="#586CB4" x="3.675" y="0" width="4.9" height="12.1621622" rx="0.5" />
                </g>
                <text id="真-空" font-family="MicrosoftYaHeiSemibold, Microsoft YaHei" font-size="16" font-weight="500" line-spacing="18" letter-spacing="0.9142857" fill="#586CB4">
                  <tspan x="16" y="39">真</tspan>
                  <tspan x="16" y="57">空</tspan>
                </text>
              </g>
            </g>
            <g id="真空储气罐" transform="translate(168.000000, 104.000000)">
              <g>
                <g id="分组-7" transform="translate(10.882988, 81.570657)">
                  <path id="矩形" d="M8.23914842,1.71621622 L3.51630131,1.71621622 L1.61319833,6.71312704 L6.33604544,6.71312704 L8.23914842,1.71621622 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M4.30636708,1.13204596 L8.15418213,1.88165981 C8.02850273,2.62291056 7.85544711,2.99353594 7.63501529,2.99353594 C6.81751088,2.99353594 6.17965101,3.26186661 5.37309718,3.8887595 C4.17148724,4.82270924 3.24445892,5.74161376 2.59201224,6.64547305 L4.30636708,1.13204596 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <g id="分组-7-copy-3" transform="translate(31.850000, 85.135135) scale(-1, 1) translate(-31.850000, -85.135135) translate(26.950000, 81.486486)">
                  <path id="矩形" d="M8.23914842,1.71621622 L3.51630131,1.71621622 L1.61319833,6.71312704 L6.33604544,6.71312704 L8.23914842,1.71621622 Z" stroke="#586DB7" fill="#FFFFFF" />
                  <path id="矩形-copy-15" d="M4.30636708,1.13204596 L8.15418213,1.88165981 C8.02850273,2.62291056 7.85544711,2.99353594 7.63501529,2.99353594 C6.81751088,2.99353594 6.17965101,3.26186661 5.37309718,3.8887595 C4.17148724,4.82270924 3.24445892,5.74161376 2.59201224,6.64547305 L4.30636708,1.13204596 Z" fill="#586CB4" opacity="0.201590402" />
                </g>
                <path id="路径" d="M34.6152365,1.48866976 C37.326286,2.18619645 39.0529545,4.64631237 39.0529545,7.5741332 L39.0529545,76.6917377 C39.0529545,80.1619739 36.5152968,82.9751563 33.0438206,82.9751563 L14.5332454,82.9751563 C11.8953271,82.9751563 9.63694264,81.3507593 8.70448427,79.0480196 C15.3289282,80.6075337 21.7977769,75.2633728 28.1110305,63.0155368 C34.4242841,50.7677009 36.5923527,30.2587452 34.6152365,1.48866976 Z" fill="#5B72C3" opacity="0.195954244" />
                <path id="矩形" d="M11.7045151,2.19014181 C15.8604771,0.397565105 20.0223592,-0.5 24.1867631,-0.5 C28.3511688,-0.5 32.5130527,0.397565866 36.6690176,2.19014456 C38.318448,2.90159266 39.3867623,4.52584102 39.3867623,6.32216342 L39.3867623,78.7027027 C39.3867623,81.1879841 37.3720437,83.2027027 34.8867623,83.2027027 L13.4867623,83.2027028 C11.0014809,83.2027028 8.98676229,81.1879842 8.98676229,78.7027028 L8.9867661,6.32215929 C8.98676614,4.52583491 10.0550823,2.90158594 11.7045151,2.19014181 Z" stroke="#586CB4" fill-opacity="0.128469187" fill="#E0E7FF" />
                <g id="分组-10" transform="translate(40.425000, 8.146332)">
                  <path id="矩形-copy-14" d="M4.36983782e-13,5.23204661 C0.296005678,6.20327872 0.698518635,6.85993559 1.20753887,7.20201719 C1.71655911,7.5440988 2.21983106,7.32341238 2.71735473,6.53995793 L2.71735473,10.0969115 L4.36983782e-13,10.0969115 L4.36983782e-13,5.23204661 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-10" stroke="#586CB4" x="-0.5" y="2.29961418" width="3.45" height="8.2972973" />
                  <path id="矩形-copy-13" d="M3.58937122,4.53675831 C4.36469493,6.06832079 5.07913858,6.99639151 5.73270218,7.32097047 C6.38626577,7.64554943 7.33369838,7.93232404 8.575,8.18129429 L8.575,11.819598 C8.575,12.0817477 8.37253003,12.2993879 8.11106309,12.3182957 L4.12543432,12.6065146 C3.85001115,12.6264317 3.61059056,12.4193031 3.59067347,12.1438799 C3.58980559,12.1318785 3.58937122,12.1198496 3.58937122,12.1078168 L3.58937122,4.53675831 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-11" stroke="#586CB4" x="3.175" y="-0.5" width="5.9" height="13.1621622" rx="0.5" />
                </g>
                <g id="分组-10-copy" transform="translate(4.287500, 68.108108) scale(-1, 1) translate(-4.287500, -68.108108) translate(0.000000, 62.027027)">
                  <path id="矩形-copy-14" d="M0,4.86486486 C0.400323466,5.83609698 0.944689316,6.49275384 1.63309755,6.83483545 C2.32150578,7.17691705 3.00213993,6.95623063 3.675,6.17277618 L3.675,9.72972973 L0,9.72972973 L0,4.86486486 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-10" stroke="#586CB4" x="0" y="2.43243243" width="3.675" height="7.2972973" />
                  <path id="矩形-copy-13" d="M3.58937122,3.64864865 C4.36469493,5.18021113 5.07913858,6.10828186 5.73270218,6.43286082 C6.38626577,6.75743978 7.33369838,7.04421438 8.575,7.29318463 L8.575,10.9314883 C8.575,11.193638 8.37253003,11.4112782 8.11106309,11.4301861 L4.12543432,11.7184049 C3.85001115,11.738322 3.61059056,11.5311934 3.59067347,11.2557703 C3.58980559,11.2437688 3.58937122,11.23174 3.58937122,11.2197072 L3.58937122,3.64864865 Z" fill="#5B72C3" opacity="0.195954244" />
                  <rect id="矩形-copy-11" stroke="#586CB4" x="3.675" y="0" width="4.9" height="12.1621622" rx="0.5" />
                </g>
                <text id="真-空" font-family="MicrosoftYaHeiSemibold, Microsoft YaHei" font-size="16" font-weight="500" line-spacing="18" letter-spacing="0.9142857" fill="#586CB4">
                  <tspan x="16" y="39">真</tspan>
                  <tspan x="16" y="57">空</tspan>
                </text>
              </g>
            </g>
            <g id="合并形状" fill-rule="nonzero">
              <use fill="#98E6D7" xlink:href="#path-1" />
              <use fill="black" fill-opacity="1" filter="url(#filter-2)" xlink:href="#path-1" />
            </g>
            <g id="路径-141" fill-rule="nonzero">
              <use fill="#98E6D7" xlink:href="#path-3" />
              <use fill="black" fill-opacity="1" filter="url(#filter-4)" xlink:href="#path-3" />
            </g>
            <g id="路径-142" fill-rule="nonzero">
              <use fill="#98E6D7" xlink:href="#path-5" />
              <use fill="black" fill-opacity="1" filter="url(#filter-6)" xlink:href="#path-5" />
            </g>
            <g id="合并形状" fill-rule="nonzero">
              <use fill="#FFB6B6" xlink:href="#path-7" />
              <use fill="black" fill-opacity="1" filter="url(#filter-8)" xlink:href="#path-7" />
            </g>
            <g id="箭头红色" transform="translate(353.000000, 289.000000)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(214.000000, 378.000000)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(558.000000, 378.000000)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(795.000000, 289.000000)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(1230.000000, 289.000000)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(1095.977012, 309.789961) rotate(-270.000000) translate(-1095.977012, -309.789961) translate(1092.977012, 304.789961)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(682.000000, 309.789961) rotate(-270.000000) translate(-682.000000, -309.789961) translate(679.000000, 304.789961)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="箭头红色" transform="translate(318.000000, 309.789961) rotate(-270.000000) translate(-318.000000, -309.789961) translate(315.000000, 304.789961)" fill="#CB1414">
              <g id="箭头" transform="translate(3.000000, 5.000000) scale(1, -1) translate(-3.000000, -5.000000) ">
                <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" fill-rule="nonzero" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
              </g>
            </g>
            <g id="合并形状" fill-rule="nonzero">
              <use fill="#FFD0BB" xlink:href="#path-9" />
              <use fill="black" fill-opacity="1" filter="url(#filter-10)" xlink:href="#path-9" />
            </g>
            <g id="合并形状" fill-rule="nonzero">
              <use fill="#CAE7FF" xlink:href="#path-11" />
              <use fill="black" fill-opacity="1" filter="url(#filter-12)" xlink:href="#path-11" />
            </g>
            <g id="流量计小" transform="translate(723.000000, 596.000000)">
              <g id="流量计" transform="translate(11.000000, 15.500000) rotate(-360.000000) translate(-11.000000, -15.500000) translate(1.000000, 1.000000)">
                <rect id="矩形" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="7" y="19" width="6" height="5" rx="1" />
                <rect id="矩形-copy-28" fill="#586CB4" x="9" y="24" width="2" height="5" />
                <circle id="椭圆形-copy-4" stroke="#586CB4" fill="#FFFFFF" transform="translate(10.000000, 10.000000) scale(-1, 1) translate(-10.000000, -10.000000) " cx="10" cy="10" r="10" />
                <circle id="椭圆形-copy-3" stroke="#586CB4" fill-opacity="0.1" fill="#586CB4" transform="translate(10.000000, 10.000000) scale(-1, 1) translate(-10.000000, -10.000000) " cx="10" cy="10" r="8" />
                <rect
                  id="矩形-copy-27"
                  stroke="#586CB4"
                  stroke-width="0.5"
                  fill-opacity="0.3"
                  fill="#586CB4"
                  transform="translate(10.000000, 10.000000) scale(-1, 1) translate(-10.000000, -10.000000) "
                  x="5"
                  y="8"
                  width="10"
                  height="4"
                  rx="0.5"
                />
              </g>
            </g>
            <g id="温度计" transform="translate(683.000000, 652.000000)">
              <g transform="translate(0.000000, -0.000000)">
                <rect id="矩形" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" transform="translate(10.000000, 21.500000) rotate(-360.000000) translate(-10.000000, -21.500000) " x="8" y="19" width="4" height="5" rx="1" />
                <polygon id="矩形-copy-28" fill="#586CB4" transform="translate(10.000000, 29.000000) rotate(-360.000000) translate(-10.000000, -29.000000) " points="9 24 11 24 11 32 12 34 8 34 9 32" />
                <circle id="椭圆形-copy-4" stroke="#586CB4" fill="#FFFFFF" transform="translate(10.000000, 10.000000) scale(-1, 1) rotate(-360.000000) translate(-10.000000, -10.000000) " cx="10" cy="10" r="10" />
                <circle id="椭圆形-copy-5" stroke="#586CB4" fill-opacity="0.1" fill="#586CB4" transform="translate(10.000000, 10.000000) scale(-1, 1) rotate(-360.000000) translate(-10.000000, -10.000000) " cx="10" cy="10" r="8" />
                <polygon id="矩形" fill="#586CB4" transform="translate(7.397114, 9.116025) rotate(-60.000000) translate(-7.397114, -9.116025) " points="7.39711432 4.6160254 8.39711432 12.9731683 7.39711432 13.6160254 6.39711432 12.9731683" />
              </g>
            </g>
            <g id="压力传感器" transform="translate(751.000000, 602.000000)" stroke="#586CB4">
              <g id="分组-3" transform="translate(1.000000, 1.000000)">
                <rect id="矩形-copy-10" fill-opacity="0.128469187" fill="#E0E7FF" x="10" y="1" width="3" height="2" />
                <rect id="矩形-copy-4" fill-opacity="0.128469187" fill="#E0E7FF" x="2" y="0" width="8" height="5" />
                <rect id="矩形-copy-9" fill-opacity="0.128469187" fill="#E0E7FF" x="3" y="9" width="6" height="13" />
                <rect id="矩形" fill-opacity="0.3" fill="#586CB4" x="0" y="5" width="12" height="4" rx="1" />
              </g>
            </g>
            <g id="压力传感器" transform="translate(711.000000, 662.000000)" stroke="#586CB4">
              <g id="分组-3" transform="translate(1.000000, 1.000000)">
                <rect id="矩形-copy-10" fill-opacity="0.128469187" fill="#E0E7FF" x="10" y="1" width="3" height="2" />
                <rect id="矩形-copy-4" fill-opacity="0.128469187" fill="#E0E7FF" x="2" y="0" width="8" height="5" />
                <rect id="矩形-copy-9" fill-opacity="0.128469187" fill="#E0E7FF" x="3" y="9" width="6" height="13" />
                <rect id="矩形" fill-opacity="0.3" fill="#586CB4" x="0" y="5" width="12" height="4" rx="1" />
              </g>
            </g>
            <text id="自来水补水" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="16" font-weight="normal" letter-spacing="0.06153851" fill="#3D5278">
              <tspan x="775" y="649">自来水补水</tspan>
            </text>
            <g id="真空计" transform="translate(20.500000, 107.000000) scale(-1, 1) rotate(-90.000000) translate(-20.500000, -107.000000) translate(13.500000, 92.500000)" stroke="#586CB4">
              <g>
                <path id="矩形-copy-16" d="M2.91115596,0 L11.088844,8.8817842e-16 C12.1581003,6.91759224e-16 13.0382287,0.841031275 13.0867811,1.90918468 L13.9049629,19.9091847 C13.9551189,21.0126149 13.1012714,21.9477812 11.9978412,21.9979371 C11.9675889,21.9993122 11.9373093,22 11.9070259,22 L2.09297414,22 C0.988404641,22 0.0929741405,21.1045695 0.0929741405,20 C0.0929741405,19.9697165 0.0936619577,19.9394369 0.0950370601,19.9091847 L0.913218878,1.90918468 C0.961771306,0.841031275 1.84189966,1.08459762e-15 2.91115596,8.8817842e-16 Z" fill-opacity="0.128469187" fill="#E0E7FF" />
                <rect id="矩形-copy-6" fill-opacity="0.3" fill="#586CB4" x="4" y="22" width="6" height="5" />
                <rect id="矩形-copy-7" fill-opacity="0.3" fill="#586CB4" x="0" y="27" width="14" height="2" rx="1" />
              </g>
            </g>
            <g id="真空计" transform="translate(110.500000, 255.000000) scale(-1, 1) rotate(-90.000000) translate(-110.500000, -255.000000) translate(103.500000, 240.500000)" stroke="#586CB4">
              <g>
                <path id="矩形-copy-16" d="M2.91115596,0 L11.088844,8.8817842e-16 C12.1581003,6.91759224e-16 13.0382287,0.841031275 13.0867811,1.90918468 L13.9049629,19.9091847 C13.9551189,21.0126149 13.1012714,21.9477812 11.9978412,21.9979371 C11.9675889,21.9993122 11.9373093,22 11.9070259,22 L2.09297414,22 C0.988404641,22 0.0929741405,21.1045695 0.0929741405,20 C0.0929741405,19.9697165 0.0936619577,19.9394369 0.0950370601,19.9091847 L0.913218878,1.90918468 C0.961771306,0.841031275 1.84189966,1.08459762e-15 2.91115596,8.8817842e-16 Z" fill-opacity="0.128469187" fill="#E0E7FF" />
                <rect id="矩形-copy-6" fill-opacity="0.3" fill="#586CB4" x="4" y="22" width="6" height="5" />
                <rect id="矩形-copy-7" fill-opacity="0.3" fill="#586CB4" x="0" y="27" width="14" height="2" rx="1" />
              </g>
            </g>
            <g id="阀门" transform="translate(246.500000, 14.000000) rotate(-90.000000) translate(-246.500000, -14.000000) translate(239.500000, 0.500000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(137.000000, 66.500000) rotate(-90.000000) translate(-137.000000, -66.500000) translate(130.000000, 53.000000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(246.500000, 118.000000) rotate(-90.000000) translate(-246.500000, -118.000000) translate(239.500000, 104.500000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(310.500000, 153.500000) rotate(-180.000000) translate(-310.500000, -153.500000) translate(303.500000, 140.000000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(750.000000, 153.500000) rotate(-180.000000) translate(-750.000000, -153.500000) translate(743.000000, 140.000000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(1190.000000, 153.500000) rotate(-180.000000) translate(-1190.000000, -153.500000) translate(1183.000000, 140.000000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="阀门" transform="translate(137.000000, 173.500000) rotate(-90.000000) translate(-137.000000, -173.500000) translate(130.000000, 160.000000)" fill="#FFFFFF" stroke="#586CB4">
              <path id="阀门复制-6-copy-5" d="M7,12.6407836 L20,7 L20,20 L7,14.3592164 L-6,20 L-6,7 L7,12.6407836 Z" transform="translate(7.000000, 13.500000) rotate(-90.000000) translate(-7.000000, -13.500000) " />
            </g>
            <g id="合并形状" fill-rule="nonzero">
              <use fill="#FFD0BB" xlink:href="#path-13" />
              <use fill="black" fill-opacity="1" filter="url(#filter-14)" xlink:href="#path-13" />
            </g>
            <text id="至一栋车间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
              <tspan x="30" y="372">至一栋车间</tspan>
            </text>
            <g id="箭头" transform="translate(223.000000, 599.000000) scale(1, -1) translate(-223.000000, -599.000000) translate(220.000000, 594.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(564.000000, 599.000000) scale(1, -1) translate(-564.000000, -599.000000) translate(561.000000, 594.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(902.000000, 594.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(823.000000, 361.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(1169.000000, 361.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(1289.000000, 289.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(853.000000, 289.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(417.000000, 289.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(1277.000000, 594.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(770.000000, 689.000000) scale(1, -1) rotate(-270.000000) translate(-770.000000, -689.000000) translate(767.000000, 684.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="箭头" transform="translate(1127.000000, 689.000000) scale(1, -1) rotate(-270.000000) translate(-1127.000000, -689.000000) translate(1124.000000, 684.000000)" fill="#B13701" fill-rule="nonzero">
              <path d="M4,4 L8,2 L8,8 L4,6 L4,8 L-2,5 L4,2 L4,4 Z" transform="translate(3.000000, 5.000000) rotate(-270.000000) translate(-3.000000, -5.000000) " />
            </g>
            <g id="1#真空计" transform="translate(45.000000, 99.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="47.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="真空度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">真空度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkj1_zkd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="51" y="17">{{ datas.zk_nyzx_cj1_zkjq3_zkj1_zkd }}kPa</tspan>
              </text>
            </g>
            <g id="隐藏" transform="translate(217.000000, 33.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="47.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="真空度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">真空度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkj1_zkd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="51" y="17">{{ datas.zk_nyzx_cj1_zkjq3_zkj1_zkd }}kPa</tspan>
              </text>
            </g>
            <g id="隐藏" transform="translate(178.000000, 201.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="47.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="真空度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">真空度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkj1_zkd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="51" y="17">{{ datas.zk_nyzx_cj1_zkjq3_zkj1_zkd }}kPa</tspan>
              </text>
            </g>
            <g id="2#真空计" transform="translate(134.000000, 247.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-31"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="47.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="真空度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">真空度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkj2_zkd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="51" y="17">{{ datas.zk_nyzx_cj1_zkjq3_zkj2_zkd }}kPa</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa3" transform="translate(1217.000000, 187.000000)" @click="showInfo">
              <rect id="矩形-copy-16" stroke="#586CB4" fill="#FFFFFF" x="0" y="0" width="98" height="77" rx="1.2096" />
              <path id="矩形-copy-19" d="M1.2096,0 L30,0 L30,77.0250538 L1.2096,77.0250538 C0.541556367,77.0250538 1.85816859e-15,76.4834974 1.77635684e-15,75.8154538 L-2.22044605e-16,1.2096 C-3.03856355e-16,0.541556367 0.541556367,1.89907446e-15 1.2096,1.77635684e-15 Z" stroke="#586CB4" fill="#FFFFFF" />
              <rect id="矩形-copy-17" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="4" y="77" width="90" height="5" />
              <g id="zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt_1" transform="translate(59.000000, 38.000000)" fill="#586CB4">
                <g :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt'):''">
                  <path id="路径" d="M0,17 C5.78009862e-15,26.3888407 7.61115925,34 17,34 C26.3888407,34 34,26.3888407 34,17 C34,7.61115925 26.3888407,3.61256164e-16 17,0 C7.61115925,-7.22512328e-16 8.67014793e-15,7.61115925 0,17 Z" stroke="#586CB4" fill-opacity="0.1" />
                  <path id="形状结合" d="M17,16 C13.6666667,12.5076158 12,9.84094917 12,8 C12,5.23857625 14.2385763,3 17,3 C19.7614237,3 22,5.23857625 22,8 C22,9.84094917 20.3333333,12.5076158 17,16 Z M16,18 C14.6421733,22.6329434 13.1661055,25.4096524 11.5717968,26.330127 C9.18033365,27.7108389 6.12238163,26.8914631 4.74166975,24.5 C3.36095788,22.1085369 4.18033365,19.0505849 6.57179677,17.669873 C8.16610551,16.7493984 11.3088399,16.8594407 16,18 Z M18,18 C22.6911601,16.8594407 25.8338945,16.7493984 27.4282032,17.669873 C29.8196663,19.0505849 30.6390421,22.1085369 29.2583302,24.5 C27.8776184,26.8914631 24.8196663,27.7108389 22.4282032,26.330127 C20.8338945,25.4096524 19.3578267,22.6329434 18,18 Z" />
                </g>
              </g>
              <text id="SULLAIR" transform="translate(14.500000, 37.989333) rotate(-90.000000) translate(-14.500000, -37.989333) " font-family="MicrosoftYaHeiUISemibold, Microsoft YaHei UI" font-size="14" font-weight="500" letter-spacing="-0.08749999" fill="#586CB4">
                <tspan x="-11.8675782" y="43.4893334">SULLAIR</tspan>
              </text>
              <text id="1#" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="20" font-weight="normal" line-spacing="20" fill="#586CB4">
                <tspan x="38" y="29">3#</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa1" transform="translate(338.000000, 187.000000)" @click="showInfo">
              <rect id="矩形-copy-16" stroke="#586CB4" fill="#FFFFFF" x="0" y="0" width="98" height="77" rx="1.2096" />
              <path id="矩形-copy-19" d="M1.2096,0 L30,0 L30,77.0250538 L1.2096,77.0250538 C0.541556367,77.0250538 1.85816859e-15,76.4834974 1.77635684e-15,75.8154538 L-2.22044605e-16,1.2096 C-3.03856355e-16,0.541556367 0.541556367,1.89907446e-15 1.2096,1.77635684e-15 Z" stroke="#586CB4" fill="#FFFFFF" />
              <rect id="矩形-copy-17" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="4" y="77" width="90" height="5" />
              <g id="zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt_1" transform="translate(59.000000, 38.000000)" fill="#586CB4">
                <g :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt'):''">
                  <path id="路径" d="M0,17 C5.78009862e-15,26.3888407 7.61115925,34 17,34 C26.3888407,34 34,26.3888407 34,17 C34,7.61115925 26.3888407,3.61256164e-16 17,0 C7.61115925,-7.22512328e-16 8.67014793e-15,7.61115925 0,17 Z" stroke="#586CB4" fill-opacity="0.1" />
                  <path id="形状结合" d="M17,16 C13.6666667,12.5076158 12,9.84094917 12,8 C12,5.23857625 14.2385763,3 17,3 C19.7614237,3 22,5.23857625 22,8 C22,9.84094917 20.3333333,12.5076158 17,16 Z M16,18 C14.6421733,22.6329434 13.1661055,25.4096524 11.5717968,26.330127 C9.18033365,27.7108389 6.12238163,26.8914631 4.74166975,24.5 C3.36095788,22.1085369 4.18033365,19.0505849 6.57179677,17.669873 C8.16610551,16.7493984 11.3088399,16.8594407 16,18 Z M18,18 C22.6911601,16.8594407 25.8338945,16.7493984 27.4282032,17.669873 C29.8196663,19.0505849 30.6390421,22.1085369 29.2583302,24.5 C27.8776184,26.8914631 24.8196663,27.7108389 22.4282032,26.330127 C20.8338945,25.4096524 19.3578267,22.6329434 18,18 Z" />
                </g>
              </g>
              <text id="SULLAIR" transform="translate(14.500000, 37.989333) rotate(-90.000000) translate(-14.500000, -37.989333) " font-family="MicrosoftYaHeiUISemibold, Microsoft YaHei UI" font-size="14" font-weight="500" letter-spacing="-0.08749999" fill="#586CB4">
                <tspan x="-11.8675782" y="43.4893334">SULLAIR</tspan>
              </text>
              <text id="1#" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="20" font-weight="normal" line-spacing="20" fill="#586CB4">
                <tspan x="38" y="29">1#</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa2" transform="translate(777.000000, 187.000000)" @click="showInfo">
              <rect id="矩形-copy-16" stroke="#586CB4" fill="#FFFFFF" x="0" y="0" width="98" height="77" rx="1.2096" />
              <path id="矩形-copy-19" d="M1.2096,0 L30,0 L30,77.0250538 L1.2096,77.0250538 C0.541556367,77.0250538 1.85816859e-15,76.4834974 1.77635684e-15,75.8154538 L-2.22044605e-16,1.2096 C-3.03856355e-16,0.541556367 0.541556367,1.89907446e-15 1.2096,1.77635684e-15 Z" stroke="#586CB4" fill="#FFFFFF" />
              <rect id="矩形-copy-17" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="4" y="77" width="90" height="5" />
              <g id="zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt_1" transform="translate(59.000000, 38.000000)" fill="#586CB4">
                <g :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt'):''">
                  <path id="路径" d="M0,17 C5.78009862e-15,26.3888407 7.61115925,34 17,34 C26.3888407,34 34,26.3888407 34,17 C34,7.61115925 26.3888407,3.61256164e-16 17,0 C7.61115925,-7.22512328e-16 8.67014793e-15,7.61115925 0,17 Z" stroke="#586CB4" fill-opacity="0.1" />
                  <path id="形状结合" d="M17,16 C13.6666667,12.5076158 12,9.84094917 12,8 C12,5.23857625 14.2385763,3 17,3 C19.7614237,3 22,5.23857625 22,8 C22,9.84094917 20.3333333,12.5076158 17,16 Z M16,18 C14.6421733,22.6329434 13.1661055,25.4096524 11.5717968,26.330127 C9.18033365,27.7108389 6.12238163,26.8914631 4.74166975,24.5 C3.36095788,22.1085369 4.18033365,19.0505849 6.57179677,17.669873 C8.16610551,16.7493984 11.3088399,16.8594407 16,18 Z M18,18 C22.6911601,16.8594407 25.8338945,16.7493984 27.4282032,17.669873 C29.8196663,19.0505849 30.6390421,22.1085369 29.2583302,24.5 C27.8776184,26.8914631 24.8196663,27.7108389 22.4282032,26.330127 C20.8338945,25.4096524 19.3578267,22.6329434 18,18 Z" />
                </g>
              </g>
              <text id="SULLAIR" transform="translate(14.500000, 37.989333) rotate(-90.000000) translate(-14.500000, -37.989333) " font-family="MicrosoftYaHeiUISemibold, Microsoft YaHei UI" font-size="14" font-weight="500" letter-spacing="-0.08749999" fill="#586CB4">
                <tspan x="-11.8675782" y="43.4893334">SULLAIR</tspan>
              </text>
              <text id="1#" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="20" font-weight="normal" line-spacing="20" fill="#586CB4">
                <tspan x="38" y="29">2#</tspan>
              </text>
            </g>
            <g id="1#寿力真空泵数据" transform="translate(446.000000, 186.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="76">运行状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa1_ljyxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="107">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_ljyxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="77">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">排气温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa1_pqwd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="47">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_pqwd }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="排气压力" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">排气压力</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa1_jzpqyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="18">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_jzpqyl }}kPa</tspan>
              </text>
            </g>
            <g id="2#寿力真空泵数据" transform="translate(885.000000, 187.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="76">运行状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa2_ljyxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="107">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_ljyxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="77">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">排气温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa2_pqwd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="47">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_pqwd }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="排气压力" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">排气压力</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa2_jzpqyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="18">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_jzpqyl }}kPa</tspan>
              </text>
            </g>
            <g id="3#寿力真空泵数据" transform="translate(1326.000000, 187.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="76">运行状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa3_ljyxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="107">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_ljyxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="77">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">排气温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa3_pqwd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="47">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_pqwd }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="排气压力" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">排气压力</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_zkb010ppa3_jzpqyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="18">{{ datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_jzpqyl }}kPa</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_lt1" transform="translate(259.000000, 427.000000)" @click="showInfo">
              <path id="矩形" d="M20.8571429,0.785714286 L77.1515679,0.785714286 C79.3607069,0.785714286 81.1515679,2.57657529 81.1515679,4.78571429 L81.1515679,11.5 L16.8571429,11.5 L16.8571429,4.78571429 C16.8571429,2.57657529 18.6480039,0.785714286 20.8571429,0.785714286 Z" stroke="#586CB4" fill-opacity="0.2" fill="#586CB4" />
              <path id="矩形复制-48" d="M2.66313134,11.5 L95.3370706,11.5 C96.4504767,11.5 97.3530706,12.4025939 97.3530706,13.516 C97.3530706,13.5715568 97.3507741,13.6270898 97.3461869,13.6824569 L90.5787432,95.3647426 C90.4921402,96.4100309 89.6184967,97.2142857 88.5696269,97.2142857 L9.43057504,97.2142857 C8.38170531,97.2142857 7.50806178,96.4100309 7.4214588,95.3647426 L0.654015092,13.6824569 C0.562083478,12.5728526 1.38707016,11.5988154 2.49667443,11.5068838 C2.55204151,11.5022965 2.60757455,11.5 2.66313134,11.5 Z" stroke="#586CB4" fill="#FFFFFF" />
              <g id="zk_nyzx_cj1_zkjq3_lt1_yxzt_1" transform="translate(6.142857, 11.500000)" fill="#586CB4">
                <g :class="datas.zk_nyzx_cj1_zkjq3_lt1_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_lt1_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_lt1_yxzt'):''">
                  <path id="路径" d="M12.5,42.8571429 C12.5,59.6229299 26.0913558,73.2142857 42.8571429,73.2142857 C59.6229299,73.2142857 73.2142857,59.6229299 73.2142857,42.8571429 C73.2142857,26.0913558 59.6229299,12.5 42.8571429,12.5 C26.0913558,12.5 12.5,26.0913558 12.5,42.8571429 Z" stroke="#586CB4" fill-opacity="0.1" transform="translate(42.857143, 42.857143) rotate(-330.000000) translate(-42.857143, -42.857143) " />
                  <path id="形状结合" d="M44.5314433,42.8564812 L44.5314433,17.8564812 C51.4350027,17.8564812 57.0314433,23.4529219 57.0314433,30.3564812 C57.0314433,37.2600406 51.4350027,42.8564812 44.5314433,42.8564812 Z M44.5314433,42.8564812 L22.8808082,55.3564812 C19.4290285,49.3778235 21.477468,41.7329434 27.4561258,38.2811637 C33.4347836,34.829384 41.0796636,36.8778235 44.5314433,42.8564812 Z M44.5314433,42.8564812 L66.1820784,55.3564812 C62.7302987,61.335139 55.0854187,63.3835785 49.1067609,59.9317988 C43.1281031,56.4800191 41.0796636,48.835139 44.5314433,42.8564812 Z" transform="translate(43.693059, 39.732525) rotate(-330.000000) translate(-43.693059, -39.732525) " />
                </g>
              </g>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_lt2" transform="translate(595.000000, 427.000000)" @click="showInfo">
              <path id="矩形" d="M20.8571429,0.785714286 L77.1515679,0.785714286 C79.3607069,0.785714286 81.1515679,2.57657529 81.1515679,4.78571429 L81.1515679,11.5 L16.8571429,11.5 L16.8571429,4.78571429 C16.8571429,2.57657529 18.6480039,0.785714286 20.8571429,0.785714286 Z" stroke="#586CB4" fill-opacity="0.2" fill="#586CB4" />
              <path id="矩形复制-48" d="M2.66313134,11.5 L95.3370706,11.5 C96.4504767,11.5 97.3530706,12.4025939 97.3530706,13.516 C97.3530706,13.5715568 97.3507741,13.6270898 97.3461869,13.6824569 L90.5787432,95.3647426 C90.4921402,96.4100309 89.6184967,97.2142857 88.5696269,97.2142857 L9.43057504,97.2142857 C8.38170531,97.2142857 7.50806178,96.4100309 7.4214588,95.3647426 L0.654015092,13.6824569 C0.562083478,12.5728526 1.38707016,11.5988154 2.49667443,11.5068838 C2.55204151,11.5022965 2.60757455,11.5 2.66313134,11.5 Z" stroke="#586CB4" fill="#FFFFFF" />
              <g id="zk_nyzx_cj1_zkjq3_lt2_yxzt_1" transform="translate(6.142857, 11.500000)" fill="#586CB4">
                <g :class="datas.zk_nyzx_cj1_zkjq3_lt2_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_lt2_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_lt2_yxzt'):''">
                  <path id="路径" d="M12.5,42.8571429 C12.5,59.6229299 26.0913558,73.2142857 42.8571429,73.2142857 C59.6229299,73.2142857 73.2142857,59.6229299 73.2142857,42.8571429 C73.2142857,26.0913558 59.6229299,12.5 42.8571429,12.5 C26.0913558,12.5 12.5,26.0913558 12.5,42.8571429 Z" stroke="#586CB4" fill-opacity="0.1" transform="translate(42.857143, 42.857143) rotate(-330.000000) translate(-42.857143, -42.857143) " />
                  <path id="形状结合" d="M44.5314433,42.8564812 L44.5314433,17.8564812 C51.4350027,17.8564812 57.0314433,23.4529219 57.0314433,30.3564812 C57.0314433,37.2600406 51.4350027,42.8564812 44.5314433,42.8564812 Z M44.5314433,42.8564812 L22.8808082,55.3564812 C19.4290285,49.3778235 21.477468,41.7329434 27.4561258,38.2811637 C33.4347836,34.829384 41.0796636,36.8778235 44.5314433,42.8564812 Z M44.5314433,42.8564812 L66.1820784,55.3564812 C62.7302987,61.335139 55.0854187,63.3835785 49.1067609,59.9317988 C43.1281031,56.4800191 41.0796636,48.835139 44.5314433,42.8564812 Z" transform="translate(43.693059, 39.732525) rotate(-330.000000) translate(-43.693059, -39.732525) " />
                </g>
              </g>
            </g>
            <g id="1#冷却塔组数据" transform="translate(367.000000, 427.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="76">运行状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq1_lt1_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="107">{{ datas.zk_nyzx_cj1_zkjq3_lt1_yxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lt1_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="77">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_lt1_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="46">出水温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_cswd010ltz1_cswd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="47">{{ datas.zk_nyzx_cj1_zkjq3_cswd010ltz1_cswd }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="63.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="进水温度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">进水温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_jswd010ltz1_jswd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="68" y="18">{{ datas.zk_nyzx_cj1_zkjq3_jswd010ltz1_jswd }}℃</tspan>
              </text>
            </g>
            <g id="1#冷却塔组数据复制" transform="translate(686.000000, 427.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-30"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="83.48"
                y="90.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <rect
                id="Rectangle-4-Copy-7复制-32"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="83.48"
                y="60.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="运行时间" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="20" y="106">运行时间</tspan>
              </text>
              <text id="运行状态" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="20" y="76">运行状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq1_lt2_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="88" y="107">{{ datas.zk_nyzx_cj1_zkjq3_lt2_yxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lt2_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="88" y="77">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_lt2_yxzt) }}</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-33"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="83.48"
                y="30.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="20" y="46">出水温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_cswd010ltz1_cswd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="88" y="47">{{ datas.zk_nyzx_cj1_zkjq3_cswd010ltz1_cswd }}℃</tspan>
              </text>
              <rect
                id="Rectangle-4-Copy-7复制-34"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="83.48"
                y="0.48"
                width="71.04"
                height="23.04"
                rx="2"
              />
              <text id="进水温度" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="20" y="16">进水温度</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_jswd010ltz1_jswd" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="88" y="18">{{ datas.zk_nyzx_cj1_zkjq3_jswd010ltz1_jswd }}℃</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_lqb1" transform="translate(943.000000, 443.000000)" @click="showInfo">
              <rect id="矩形" stroke="#586CB4" fill="#FFFFFF" x="27.4509804" y="0" width="74.5098039" height="45.2580645" rx="4" />
              <path id="矩形-copy" d="M31.4509804,0 L37.254902,0 L37.254902,45.2580645 L31.4509804,45.2580645 C29.2418414,45.2580645 27.4509804,43.4672035 27.4509804,41.2580645 L27.4509804,4 C27.4509804,1.790861 29.2418414,4.05812251e-16 31.4509804,0 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" />
              <path id="矩形-copy-6" d="M19.6470588,11.8064516 L27.4509804,11.8064516 L27.4509804,31.483871 L19.6470588,31.483871 C18.5424893,31.483871 17.6470588,30.5884405 17.6470588,29.483871 L17.6470588,13.8064516 C17.6470588,12.7018821 18.5424893,11.8064516 19.6470588,11.8064516 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" />
              <rect id="矩形-copy-7" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="1.96078431" y="11.8064516" width="7.84313725" height="19.6774194" rx="1" />
              <rect id="矩形-copy-8" fill="#576BB3" x="9.80392157" y="19.6774194" width="7.84313725" height="3.93548387" />
              <path id="矩形-copy-2" d="M96.1568627,0 L101.960784,0 L101.960784,45.2580645 L96.1568627,45.2580645 C93.9477237,45.2580645 92.1568627,43.4672035 92.1568627,41.2580645 L92.1568627,4 C92.1568627,1.790861 93.9477237,4.05812251e-16 96.1568627,0 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" transform="translate(97.058824, 22.629032) scale(-1, 1) translate(-97.058824, -22.629032) " />
              <rect id="矩形" fill="url(#linearGradient-15)" x="41.1764706" y="7.87096774" width="47.0588235" height="7.87096774" rx="2" />
              <rect id="矩形-copy-3" fill="url(#linearGradient-15)" x="41.1764706" y="19.6774194" width="47.0588235" height="7.87096774" rx="2" />
              <rect id="矩形-copy-5" fill="url(#linearGradient-15)" x="41.1764706" y="31.483871" width="47.0588235" height="7.87096774" rx="2" />
              <g id="zk_nyzx_cj1_zkjq3_lqb1_yxzt_1" transform="translate(0.000000, 35.419355)">
                <g :class="datas.zk_nyzx_cj1_zkjq3_lqb1_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_lqb1_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_lqb1_yxzt'):''">
                  <path id="路径-copy" d="M-0.5,13.7741935 C-0.5,5.89116982 5.86857166,-0.5 13.7254902,-0.5 C21.5824087,-0.5 27.9509804,5.89116982 27.9509804,13.7741935 C27.9509804,21.6572173 21.5824087,28.0483871 13.7254902,28.0483871 C5.86857166,28.0483871 -0.5,21.6572173 -0.5,13.7741935 Z" stroke="#586CB4" fill="#F2F4FC" />
                  <path id="形状结合" d="M13.7254902,13.7741935 L13.7254902,1.96774194 C16.974224,1.96774194 19.6078431,4.61070615 19.6078431,7.87096774 C19.6078431,11.1312293 16.974224,13.7741935 13.7254902,13.7741935 Z M13.7254902,13.7741935 L23.9140244,19.6774194 C22.2896574,22.5008887 18.6920668,23.4682808 15.8785808,21.83815 C13.0650948,20.2080192 12.1011233,16.5976629 13.7254902,13.7741935 Z M13.7254902,13.7741935 L3.53695603,19.6774194 C1.91258912,16.85395 2.87656062,13.2435937 5.69004664,11.6134629 C8.50353266,9.98333215 12.1011233,10.9507242 13.7254902,13.7741935 Z" fill="#586CB4" />
                </g>
              </g>
              <polyline id="路径-206" stroke="#586CB4" points="28.3131998 51.8696774 93.1529658 51.8696774 93.1529658 45.2580645" />
            </g>
            <g id="zk_nyzx_cj1_zkjq3_lqb2" transform="translate(1289.000000, 443.000000)" @click="showInfo">
              <rect id="矩形" stroke="#586CB4" fill="#FFFFFF" x="27.4509804" y="0" width="74.5098039" height="45.2580645" rx="4" />
              <path id="矩形-copy" d="M31.4509804,0 L37.254902,0 L37.254902,45.2580645 L31.4509804,45.2580645 C29.2418414,45.2580645 27.4509804,43.4672035 27.4509804,41.2580645 L27.4509804,4 C27.4509804,1.790861 29.2418414,4.05812251e-16 31.4509804,0 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" />
              <path id="矩形-copy-6" d="M19.6470588,11.8064516 L27.4509804,11.8064516 L27.4509804,31.483871 L19.6470588,31.483871 C18.5424893,31.483871 17.6470588,30.5884405 17.6470588,29.483871 L17.6470588,13.8064516 C17.6470588,12.7018821 18.5424893,11.8064516 19.6470588,11.8064516 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" />
              <rect id="矩形-copy-7" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" x="1.96078431" y="11.8064516" width="7.84313725" height="19.6774194" rx="1" />
              <rect id="矩形-copy-8" fill="#576BB3" x="9.80392157" y="19.6774194" width="7.84313725" height="3.93548387" />
              <path id="矩形-copy-2" d="M96.1568627,0 L101.960784,0 L101.960784,45.2580645 L96.1568627,45.2580645 C93.9477237,45.2580645 92.1568627,43.4672035 92.1568627,41.2580645 L92.1568627,4 C92.1568627,1.790861 93.9477237,4.05812251e-16 96.1568627,0 Z" stroke="#586CB4" fill-opacity="0.3" fill="#586CB4" transform="translate(97.058824, 22.629032) scale(-1, 1) translate(-97.058824, -22.629032) " />
              <rect id="矩形" fill="url(#linearGradient-15)" x="41.1764706" y="7.87096774" width="47.0588235" height="7.87096774" rx="2" />
              <rect id="矩形-copy-3" fill="url(#linearGradient-15)" x="41.1764706" y="19.6774194" width="47.0588235" height="7.87096774" rx="2" />
              <rect id="矩形-copy-5" fill="url(#linearGradient-15)" x="41.1764706" y="31.483871" width="47.0588235" height="7.87096774" rx="2" />
              <g id="zk_nyzx_cj1_zkjq3_lqb2_yxzt_1" transform="translate(0.000000, 35.419355)">
                <g :class="datas.zk_nyzx_cj1_zkjq3_lqb2_yxzt?getClass():''" :style="datas.zk_nyzx_cj1_zkjq3_lqb2_yxzt?getOrigin('zk_nyzx_cj1_zkjq3_lqb2_yxzt'):''">
                  <path id="路径-copy" d="M-0.5,13.7741935 C-0.5,5.89116982 5.86857166,-0.5 13.7254902,-0.5 C21.5824087,-0.5 27.9509804,5.89116982 27.9509804,13.7741935 C27.9509804,21.6572173 21.5824087,28.0483871 13.7254902,28.0483871 C5.86857166,28.0483871 -0.5,21.6572173 -0.5,13.7741935 Z" stroke="#586CB4" fill="#F2F4FC" />
                  <path id="形状结合" d="M13.7254902,13.7741935 L13.7254902,1.96774194 C16.974224,1.96774194 19.6078431,4.61070615 19.6078431,7.87096774 C19.6078431,11.1312293 16.974224,13.7741935 13.7254902,13.7741935 Z M13.7254902,13.7741935 L23.9140244,19.6774194 C22.2896574,22.5008887 18.6920668,23.4682808 15.8785808,21.83815 C13.0650948,20.2080192 12.1011233,16.5976629 13.7254902,13.7741935 Z M13.7254902,13.7741935 L3.53695603,19.6774194 C1.91258912,16.85395 2.87656062,13.2435937 5.69004664,11.6134629 C8.50353266,9.98333215 12.1011233,10.9507242 13.7254902,13.7741935 Z" fill="#586CB4" />
                </g>
              </g>
              <polyline id="路径-206" stroke="#586CB4" points="28.3131998 51.8696774 93.1529658 51.8696774 93.1529658 45.2580645" />
            </g>
            <g id="1#冷却泵数据" transform="translate(1055.000000, 427.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-79"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="0.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <rect
                id="Rectangle-4-Copy-7复制-80"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="53.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <rect
                id="Rectangle-4-Copy-7复制-81"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="27.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <text id="压力复制-8" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">压力</tspan>
              </text>
              <text id="时间复制-8" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="69">时间</tspan>
              </text>
              <text id="状态复制-9" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="43">状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_csylz010lqb1_csyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="17">{{ datas.zk_nyzx_cj1_zkjq3_csylz010lqb1_csyl }}kPa</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lqb1_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="70">{{ datas.zk_nyzx_cj1_zkjq3_lqb1_yxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lqb1_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="44">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_lqb1_yxzt) }}</tspan>
              </text>
            </g>
            <g id="2#冷却泵数据" transform="translate(1401.000000, 427.000000)">
              <rect
                id="Rectangle-4-Copy-7复制-79"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="0.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <rect
                id="Rectangle-4-Copy-7复制-80"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="53.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <rect
                id="Rectangle-4-Copy-7复制-81"
                stroke-opacity="0.289881993"
                stroke="#8A9FF4"
                stroke-width="0.96"
                fill-opacity="0.0795454545"
                fill="#8A9FF4"
                x="34.48"
                y="27.48"
                width="72"
                height="22.08"
                rx="1.92"
              />
              <text id="压力复制-8" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="16">压力</tspan>
              </text>
              <text id="时间复制-8" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="69">时间</tspan>
              </text>
              <text id="状态复制-9" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="13" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="43">状态</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_csylz010lqb1_csyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="17">{{ datas.zk_nyzx_cj1_zkjq3_csylz010lqb1_csyl }}kPa</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lqb2_yxsj" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="70">{{ datas.zk_nyzx_cj1_zkjq3_lqb2_yxsj }}h</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_lqb2_yxzt" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="38" y="44">{{ getGuZhang(datas.zk_nyzx_cj1_zkjq3_lqb2_yxzt) }}</tspan>
              </text>
            </g>
            <g id="1#冷却塔组流量计" transform="translate(744.000000, 571.000000)">
              <rect id="Rectangle-4-Copy-7复制-32" stroke-opacity="0.289881993" stroke="#8A9FF4" stroke-width="0.96" fill-opacity="0.0795454545" fill="#8A9FF4" x="65.48" y="0.48" width="71.04" height="23.04" />
              <text id="瞬时流量" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="11" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="15.56">瞬时流量</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_llj010ltz1_ssll" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="69" y="17">{{ datas.zk_nyzx_cj1_zkjq3_llj010ltz1_ssll }}m³/h</tspan>
              </text>
            </g>
            <g id="1#冷却塔组压力传感器" transform="translate(771.000000, 600.000000)">
              <rect id="Rectangle-4-Copy-7复制-32" stroke-opacity="0.289881993" stroke="#8A9FF4" stroke-width="0.96" fill-opacity="0.0795454545" fill="#8A9FF4" x="38.48" y="0.48" width="71.04" height="23.04" />
              <text id="压力" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" line-spacing="11" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="0" y="15.56">压力</tspan>
              </text>
              <text id="zk_nyzx_cj1_zkjq3_yl010ltz1_bsyl" font-family="MicrosoftYaHeiUI, Microsoft YaHei UI" font-size="14" font-weight="normal" letter-spacing="0.0538462" fill="#3D5278">
                <tspan x="42.277583" y="17">{{ datas.zk_nyzx_cj1_zkjq3_yl010ltz1_bsyl }}kPa</tspan>
              </text>
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa1_qgzzt" :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_qgzzt?'gzclass':datas.zk_nyzx_cj1_zkjq3_zkb010ppa1_zgzzt?'ggzclass':'noclass'" transform="translate(393.000000, 218.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-17)" xlink:href="#path-16" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-16" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa2_qgzzt" :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_qgzzt?'gzclass':datas.zk_nyzx_cj1_zkjq3_zkb010ppa2_zgzzt?'ggzclass':'noclass'" transform="translate(832.000000, 218.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-19)" xlink:href="#path-18" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-18" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g id="zk_nyzx_cj1_zkjq3_zkb010ppa3_qgzzt" :class="datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_qgzzt?'gzclass':datas.zk_nyzx_cj1_zkjq3_zkb010ppa3_zgzzt?'ggzclass':'noclass'" transform="translate(1272.000000, 220.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-21)" xlink:href="#path-20" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-20" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g v-if="false" id="1#lqtgz" transform="translate(286.000000, 462.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-23)" xlink:href="#path-22" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-22" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g v-if="false" id="2#lqtgz" transform="translate(623.000000, 462.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-25)" xlink:href="#path-24" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-24" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="19.0003232" y="7.51260322" width="4.77777778" height="17.6956522" rx="2.38888889" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="19.0003232" y="28.4256467" width="4.77777778" height="4.82608696" rx="2.38888889" />
            </g>
            <g v-if="false" id="1#lqbgz" transform="translate(943.000000, 479.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-27)" xlink:href="#path-26" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-26" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="11.9304355" y="4.6699966" width="3" height="11" rx="1.5" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="11.9304355" y="17.6699966" width="3" height="3" rx="1.5" />
            </g>
            <g v-if="false" id="2#lqbgz" transform="translate(1289.000000, 479.000000)">
              <g id="三角形">
                <use fill="black" fill-opacity="1" filter="url(#filter-29)" xlink:href="#path-28" />
                <use fill="#FF2A2A" fill-rule="evenodd" xlink:href="#path-28" />
              </g>
              <rect id="矩形" fill="#FFFFFF" x="11.9304355" y="4.6699966" width="3" height="11" rx="1.5" />
              <rect id="矩形复制-2" fill="#FFFFFF" x="11.9304355" y="17.6699966" width="3" height="3" rx="1.5" />
            </g>
          </g>
        </g>
      </g>
    </svg>
  </div>
</template>
<script>
import monitorapi from '@/api/monitor/monitor'
import infoScan from '@/views/project/monitor/infoScan'
import lineScan from '@/views/project/monitor/lineScan'
import $ from 'jquery'
import '@/api/monitor/svgtool'
export default {
  name: 'System',
  components: {
    infoScan,
    lineScan
  },
  data() {
    return {
      datas: {},
      code: '',
      linecode: ''
    }
  },
  mounted() {
    $('svg').svgPanZoom()
    const self = this
    monitorapi.getZhenKongData({
      'regional': 'cj1'
    }).then(res => {
      if (res.state === 1) {
        self.datas = res.data
      }
    }).catch(err => {
      console.log(err)
    })
    $('svg').click(function(e) {
      var linecode = (e.target.parentElement.attributes.id && e.target.parentElement.attributes.id.value) || (e.target.attributes.id && e.target.attributes.id.value)
      self.linecode = linecode
      debugger
      if (linecode &&
          linecode.split('_').length === 6 &&
          linecode.indexOf('zk_nyzx_') !== -1 &&
          linecode.indexOf('_yxzt') === -1 &&
          linecode.indexOf('_kyjzt') === -1 &&
          linecode.indexOf('_yxsj') === -1) {
        self.$refs.lineScan.dialogTableVisible = true
      }
    })
  },
  methods: {
    showInfo(e) {
      this.code = e.currentTarget.attributes.id.value
      this.$refs.infoScan.dialogTableVisible = true
    },
    showLine(e) {
      this.linecode = e.currentTarget.attributes.code.value
      this.$refs.lineScan.dialogTableVisible = true
    },
    getGuZhang(type) {
      return monitorapi.getGuZhang(type)
    },
    getGuZhangGif(val1, val2) {
      return monitorapi.getGuZhangGif(val1, val2)
    },
    getGuZhangColor(val1, val2) {
      return monitorapi.getGuZhangColor(val1, val2)
    },
    getOrigin(id) {
      if (!id) return
      const box = document.getElementById(id + '_1').getBBox()
      const x = box.x + (box.width / 2)
      const y = box.y + (box.height / 2)
      const a = x + 'px' + ' ' + y + 'px'
      return '-webkit-transform-origin:' + a
    },
    getClass() {
      return 'zhuanquan'
    }
  }
}
</script>
<style scoped lang="scss">
</style>
